var pcd = [{
    "pId": 1,
    "pName": "黑龙江",
    "Cities": [{
        "cId": 1,
        "cName": "大庆",
        "Dealers": [{
            "dName": "大庆世腾骏兴汽车销售服务有限公司",
            "dCode": "S723022"
        }, {
            "dName": "大庆世腾汽车销售有限公司",
            "dCode": "S723016"
        }, {
            "dName": "大庆名派汽车销售服务有限公司",
            "dCode": "S723030"
        }]
    }, {
        "cId": 2,
        "cName": "哈尔滨",
        "Dealers": [{
            "dName": "哈尔滨诚杰汽车销售有限公司",
            "dCode": "S723024"
        }, {
            "dName": "黑龙江运通俊业汽车销售服务有限公司",
            "dCode": "S723009"
        }, {
            "dName": "黑龙江博远汽车维修有限公司",
            "dCode": "S723012"
        }, {
            "dName": "哈尔滨中汽汽贸汽车销售服务有限公司",
            "dCode": "S723019"
        }, {
            "dName": "黑龙江龙海汽车销售集团有限公司",
            "dCode": "S723023"
        }, {
            "dName": "哈尔滨一汽森华汽车贸易有限公司",
            "dCode": "S923002"
        }]
    }, {
        "cId": 3,
        "cName": "绥化",
        "Dealers": [{
            "dName": "黑龙江龙众汽车销售服务有限公司",
            "dCode": "S723025"
        }]
    }, {
        "cId": 4,
        "cName": "牡丹江",
        "Dealers": [{
            "dName": "牡丹江中信汽车销售服务有限责任公司",
            "dCode": "S723014"
        }]
    }, {
        "cId": 5,
        "cName": "佳木斯",
        "Dealers": [{
            "dName": "佳木斯安诚轿车销售服务有限公司",
            "dCode": "S723015"
        }]
    }, {
        "cId": 6,
        "cName": "鸡西",
        "Dealers": [{
            "dName": "鸡西市英华进口汽车服务有限公司",
            "dCode": "S723020"
        }]
    }, {
        "cId": 7,
        "cName": "齐齐哈尔",
        "Dealers": [{
            "dName": "齐齐哈尔粤华轿车销售有限公司",
            "dCode": "S723021"
        }, {
            "dName": "齐齐哈尔华明晟通汽车销售有限公司",
            "dCode": "S723027"
        }]
    }, {
        "cId": 8,
        "cName": "鹤岗",
        "Dealers": [{
            "dName": "鹤岗骏达汽车销售有限公司",
            "dCode": "S723026"
        }]
    }, {
        "cId": 9,
        "cName": "双鸭山",
        "Dealers": [{
            "dName": "双鸭山安诚汽车销售服务有限公司",
            "dCode": "S723028"
        }]
    }, {
        "cId": 10,
        "cName": "加格达奇区",
        "Dealers": [{
            "dName": "大兴安岭龙海兴众汽车销售服务有限公司",
            "dCode": "S723029"
        }]
    }, {
        "cId": 11,
        "cName": "北安",
        "Dealers": [{
            "dName": "北安市粤华汽车销售有限公司",
            "dCode": "S723031"
        }]
    }, {
        "cId": 12,
        "cName": "富锦",
        "Dealers": [{
            "dName": "富锦安诚汽车销售服务有限公司",
            "dCode": "S223001"
        }]
    }, {
        "cId": 13,
        "cName": "伊春",
        "Dealers": [{
            "dName": "伊春龙海德众汽车销售有限公司",
            "dCode": "S223002"
        }]
    }, {
        "cId": 14,
        "cName": "五常",
        "Dealers": [{
            "dName": "黑龙江龙海博众汽车销售服务有限公司",
            "dCode": "S223003"
        }]
    }]
}, {
    "pId": 2,
    "pName": "吉林",
    "Cities": [{
        "cId": 15,
        "cName": "长春",
        "Dealers": [{
            "dName": "长春汇腾汽车销售服务有限公司",
            "dCode": "S722032"
        }, {
            "dName": "长春瑞骐汽车销售服务有限公司",
            "dCode": "S722035"
        }, {
            "dName": "长春一汽实业众捷汽车销售有限公司",
            "dCode": "S722039"
        }, {
            "dName": "吉林省华之诚汽车销售服务有限公司",
            "dCode": "S722028"
        }, {
            "dName": "吉林省久恒汽车销售服务有限公司",
            "dCode": "S722057"
        }, {
            "dName": "长春禾根汽车销售有限公司",
            "dCode": "S722038"
        }, {
            "dName": "吉林省华之诚世达汽车销售服务有限公司",
            "dCode": "S722041"
        }, {
            "dName": "吉林省驰恒汽车销售服务有限公司",
            "dCode": "S722037"
        }, {
            "dName": "吉林省吉刚汽车贸易有限公司",
            "dCode": "S722005"
        }, {
            "dName": "长春市华阳汽车贸易有限责任公司",
            "dCode": "S722017"
        }, {
            "dName": "长春通立汽车商贸有限公司",
            "dCode": "S722030"
        }, {
            "dName": "长春通立德众汽车服务有限公司",
            "dCode": "S722044"
        }]
    }, {
        "cId": 16,
        "cName": "吉林",
        "Dealers": [{
            "dName": "吉林市神洲大众汽车销售服务有限公司",
            "dCode": "S722033"
        }, {
            "dName": "吉林市神华大众汽车服务有限责任公司",
            "dCode": "S722002"
        }]
    }, {
        "cId": 17,
        "cName": "松原",
        "Dealers": [{
            "dName": "松原汇众汽车销售服务有限公司",
            "dCode": "S722040"
        }, {
            "dName": "吉林石油装备汽车销售维修服务有限公司",
            "dCode": "S722027"
        }]
    }, {
        "cId": 18,
        "cName": "白城",
        "Dealers": [{
            "dName": "白城汇众汽车销售服务有限公司",
            "dCode": "S722058"
        }]
    }, {
        "cId": 19,
        "cName": "榆树",
        "Dealers": [{
            "dName": "吉林省驰久汽车销售服务有限公司",
            "dCode": "S222003"
        }]
    }, {
        "cId": 20,
        "cName": "白山",
        "Dealers": [{
            "dName": "白山市众合汽车销售维修有限公司",
            "dCode": "S722026"
        }]
    }, {
        "cId": 21,
        "cName": "四平",
        "Dealers": [{
            "dName": "四平汇众汽车销售服务有限公司",
            "dCode": "S722036"
        }]
    }, {
        "cId": 22,
        "cName": "延吉",
        "Dealers": [{
            "dName": "延吉中诚汽车贸易有限公司",
            "dCode": "S722021"
        }]
    }, {
        "cId": 23,
        "cName": "通化",
        "Dealers": [{
            "dName": "通化鑫宇汽车销售有限公司",
            "dCode": "S722023"
        }]
    }, {
        "cId": 24,
        "cName": "双辽",
        "Dealers": [{
            "dName": "双辽汇众汽车销售服务有限公司",
            "dCode": "S222002"
        }]
    }, {
        "cId": 25,
        "cName": "辽源",
        "Dealers": [{
            "dName": "辽源市聚鑫汽车销售服务有限公司",
            "dCode": "S722059"
        }]
    }]
}, {
    "pId": 3,
    "pName": "辽宁",
    "Cities": [{
        "cId": 26,
        "cName": "铁岭",
        "Dealers": [{
            "dName": "铁岭市顺峰（集团）汽车销售服务有限公司",
            "dCode": "S721028"
        }, {
            "dName": "铁岭和成汽车销售服务有限公司",
            "dCode": "S721034"
        }]
    }, {
        "cId": 27,
        "cName": "沈阳",
        "Dealers": [{
            "dName": "沈阳和昊汽车销售服务有限公司",
            "dCode": "S721031"
        }, {
            "dName": "沈阳市庞大一众汽车销售有限公司",
            "dCode": "S721037"
        }, {
            "dName": "辽宁惠华汽车集团有限公司",
            "dCode": "S721024"
        }, {
            "dName": "沈阳合众汽车服务有限公司",
            "dCode": "S721025"
        }, {
            "dName": "辽宁和兴大众汽车销售服务有限公司",
            "dCode": "S921003"
        }, {
            "dName": "沈阳惠华新业汽车销售服务有限公司",
            "dCode": "S221001"
        }, {
            "dName": "辽宁惠华新业集团新民汽车销售服务有限公司",
            "dCode": "S221002"
        }]
    }, {
        "cId": 28,
        "cName": "抚顺",
        "Dealers": [{
            "dName": "抚顺和昆汽车销售服务有限公司",
            "dCode": "S721035"
        }]
    }, {
        "cId": 29,
        "cName": "本溪",
        "Dealers": [{
            "dName": "辽宁惠华集团本溪汽车销售服务有限公司",
            "dCode": "S721039"
        }]
    }, {
        "cId": 30,
        "cName": "丹东",
        "Dealers": [{
            "dName": "丹东曙光新天地汽车销售服务有限公司",
            "dCode": "S721044"
        }]
    }, {
        "cId": 31,
        "cName": "辽中",
        "Dealers": [{
            "dName": "辽宁惠华新业集团辽中汽车销售服务有限公司",
            "dCode": "S221003"
        }]
    }, {
        "cId": 32,
        "cName": "阜新",
        "Dealers": [{
            "dName": "阜新和利汽车销售服务有限公司",
            "dCode": "S721036"
        }, {
            "dName": "阜新永生工贸发展有限公司",
            "dCode": "S721007"
        }]
    }, {
        "cId": 33,
        "cName": "朝阳",
        "Dealers": [{
            "dName": "辽宁惠华集团朝阳汽车销售服务有限公司",
            "dCode": "S721038"
        }]
    }, {
        "cId": 34,
        "cName": "葫芦岛",
        "Dealers": [{
            "dName": "葫芦岛市维立达汽车服务有限公司",
            "dCode": "S721013"
        }]
    }, {
        "cId": 35,
        "cName": "锦州",
        "Dealers": [{
            "dName": "锦州通用汽车销售服务有限公司",
            "dCode": "S721019"
        }]
    }, {
        "cId": 36,
        "cName": "盘锦",
        "Dealers": [{
            "dName": "盘锦隆达汽车产品销售服务有限公司",
            "dCode": "S721030"
        }]
    }, {
        "cId": 37,
        "cName": "鞍山",
        "Dealers": [{
            "dName": "鞍山谛赢汽车销售服务有限公司",
            "dCode": "S721032"
        }, {
            "dName": "鞍山市中田汽车贸易有限公司",
            "dCode": "S921017"
        }]
    }, {
        "cId": 38,
        "cName": "辽阳",
        "Dealers": [{
            "dName": "辽阳凯众汽车销售服务有限公司",
            "dCode": "S721033"
        }]
    }, {
        "cId": 39,
        "cName": "大连",
        "Dealers": [{
            "dName": "大连通孚祥汽车贸易有限公司",
            "dCode": "S721029"
        }, {
            "dName": "大连弘鼎汽车销售服务有限公司",
            "dCode": "S721041"
        }, {
            "dName": "大连禾众汽车销售服务有限公司",
            "dCode": "S721040"
        }, {
            "dName": "大连捷仕达汽车销售服务有限公司",
            "dCode": "S721016"
        }, {
            "dName": "大连汽贸集团汽车销售服务有限公司",
            "dCode": "S921002"
        }]
    }, {
        "cId": 40,
        "cName": "营口",
        "Dealers": [{
            "dName": "营口盛世悦众汽车销售服务有限公司",
            "dCode": "S721042"
        }, {
            "dName": "营口红运汇众汽车销售服务有限公司",
            "dCode": "S721027"
        }]
    }, {
        "cId": 41,
        "cName": "瓦房店",
        "Dealers": [{
            "dName": "瓦房店市顺发物资商贸有限公司",
            "dCode": "S721018"
        }]
    }, {
        "cId": 42,
        "cName": "庄河",
        "Dealers": [{
            "dName": "大连中联伟业汽车销售有限公司",
            "dCode": "S721043"
        }]
    }, {
        "cId": 43,
        "cName": "灯塔",
        "Dealers": [{
            "dName": "灯塔凯祥汽车销售服务有限公司",
            "dCode": "S221004"
        }]
    }]
}, {
    "pId": 4,
    "pName": "内蒙古",
    "Cities": [{
        "cId": 44,
        "cName": "呼伦贝尔",
        "Dealers": [{
            "dName": "呼伦贝尔市华通汽车销售有限公司",
            "dCode": "S715016"
        }]
    }, {
        "cId": 45,
        "cName": "通辽",
        "Dealers": [{
            "dName": "通辽市利丰泰宇汽车销售服务有限公司",
            "dCode": "S715034"
        }, {
            "dName": "通辽庞大一众汽车销售服务有限公司",
            "dCode": "S715029"
        }]
    }, {
        "cId": 46,
        "cName": "呼和浩特",
        "Dealers": [{
            "dName": "内蒙古利丰泰宇汽车服务有限公司",
            "dCode": "S715021"
        }, {
            "dName": "呼和浩特市庞大一众汽车销售服务有限公司",
            "dCode": "S715027"
        }, {
            "dName": "内蒙古亿阳汇众汽车销售有限公司",
            "dCode": "S715014"
        }, {
            "dName": "内蒙古众和汽车销售服务有限公司",
            "dCode": "S715023"
        }]
    }, {
        "cId": 47,
        "cName": "锡林浩特",
        "Dealers": [{
            "dName": "锡林浩特庞大一众汽车销售服务有限公司",
            "dCode": "S715028"
        }]
    }, {
        "cId": 48,
        "cName": "乌兰察布",
        "Dealers": [{
            "dName": "乌兰察布市捷通众达汽车销售服务有限公司",
            "dCode": "S715026"
        }]
    }, {
        "cId": 49,
        "cName": "乌兰浩特",
        "Dealers": [{
            "dName": "兴安盟利丰泰宇汽车销售有限公司",
            "dCode": "S715030"
        }]
    }, {
        "cId": 50,
        "cName": "赤峰",
        "Dealers": [{
            "dName": "赤峰坤驰汽车销售服务有限公司",
            "dCode": "S715032"
        }, {
            "dName": "赤峰凯富达汽车服务有限公司",
            "dCode": "S715011"
        }]
    }, {
        "cId": 51,
        "cName": "敖汉旗",
        "Dealers": [{
            "dName": "赤峰隆瑞商贸有限公司",
            "dCode": "S215003"
        }]
    }, {
        "cId": 52,
        "cName": "鄂尔多斯",
        "Dealers": [{
            "dName": "鄂尔多斯市鑫安汽车贸易服务有限责任公司",
            "dCode": "S715017"
        }, {
            "dName": "鄂尔多斯市鑫安基业汽车销售有限责任公司",
            "dCode": "S715015"
        }]
    }, {
        "cId": 53,
        "cName": "巴彦淖尔",
        "Dealers": [{
            "dName": "巴彦淖尔市航海汽车销售服务有限公司",
            "dCode": "S715020"
        }]
    }, {
        "cId": 54,
        "cName": "乌海",
        "Dealers": [{
            "dName": "乌海市鑫安众诚汽贸有限公司",
            "dCode": "S715022"
        }]
    }, {
        "cId": 55,
        "cName": "包头",
        "Dealers": [{
            "dName": "包头市惠众汽车服务有限公司",
            "dCode": "S715033"
        }, {
            "dName": "包头市东信泰德汽车销售服务有限公司",
            "dCode": "S715031"
        }, {
            "dName": "包头庞大一众汽车销售服务有限公司",
            "dCode": "S715025"
        }, {
            "dName": "包头德众汽车服务有限公司",
            "dCode": "S715009"
        }]
    }, {
        "cId": 56,
        "cName": "乌审旗",
        "Dealers": [{
            "dName": "乌审旗鑫安亿恒汽车销售有限责任公司",
            "dCode": "S215001"
        }]
    }]
}, {
    "pId": 5,
    "pName": "北京",
    "Cities": [{
        "cId": 57,
        "cName": "北京",
        "Dealers": [{
            "dName": "北京鑫万维富达汽车销售有限公司",
            "dCode": "S711046"
        }, {
            "dName": "北京联拓通达汽车销售服务有限公司",
            "dCode": "S711050"
        }, {
            "dName": "北京上地四方汽车销售服务有限公司",
            "dCode": "S711052"
        }, {
            "dName": "北京海联力捷汽车销售服务有限公司",
            "dCode": "S711058"
        }, {
            "dName": "北京海联力通经贸有限公司",
            "dCode": "S711002"
        }, {
            "dName": "北京鑫万维汽车经贸有限公司",
            "dCode": "S711029"
        }, {
            "dName": "北京拓展工贸发展有限公司",
            "dCode": "S911025"
        }, {
            "dName": "北京市天达汽车修理有限公司",
            "dCode": "S711033"
        }, {
            "dName": "北京德奥达一众汽车销售有限公司",
            "dCode": "S711043"
        }, {
            "dName": "北京博瑞祥泰汽车销售服务有限公司",
            "dCode": "S711053"
        }, {
            "dName": "北京友联威科汽车销售服务有限公司",
            "dCode": "S711028"
        }, {
            "dName": "北京联拓亿众汽车服务有限公司",
            "dCode": "S711056"
        }, {
            "dName": "北京运通兴恩汽车销售服务有限公司",
            "dCode": "S711051"
        }, {
            "dName": "北京运通博恩汽车销售服务有限公司",
            "dCode": "S711021"
        }, {
            "dName": "北京北方华驿车辆销售服务有限公司",
            "dCode": "S711034"
        }, {
            "dName": "大众汽车服务中心（北京）有限公司",
            "dCode": "S711038"
        }, {
            "dName": "北京庆洋惠众汽车服务有限公司",
            "dCode": "S711061"
        }, {
            "dName": "北京长久博众汽车销售服务有限公司",
            "dCode": "S711060"
        }, {
            "dName": "北京庆洋汽车服务有限公司",
            "dCode": "S711012"
        }, {
            "dName": "北京骏宝威汽车贸易有限公司",
            "dCode": "S711023"
        }, {
            "dName": "北京冀东丰汽车销售服务有限公司",
            "dCode": "S711032"
        }, {
            "dName": "北京首汽腾鹏汽车销售服务有限公司",
            "dCode": "S711030"
        }, {
            "dName": "北京东仁金舆汽车销售服务有限公司",
            "dCode": "S711036"
        }, {
            "dName": "北京亚之杰伯乐汽车销售服务有限公司",
            "dCode": "S711048"
        }, {
            "dName": "北京运通嘉恩汽车销售服务有限公司",
            "dCode": "S711059"
        }, {
            "dName": "北京汽车贸易中心有限公司",
            "dCode": "S711042"
        }, {
            "dName": "北京博瑞祥弘汽车销售服务有限公司",
            "dCode": "S711055"
        }, {
            "dName": "北京华昌汽车销售服务有限公司",
            "dCode": "S911028"
        }, {
            "dName": "北京华信宏业商贸有限公司",
            "dCode": "S711039"
        }, {
            "dName": "北京捷亚泰中盛汽车销售有限公司",
            "dCode": "S711047"
        }, {
            "dName": "北京捷亚泰中兴汽车销售有限公司",
            "dCode": "S711049"
        }, {
            "dName": "北京捷亚泰万兴汽车销售有限公司",
            "dCode": "S711057"
        }, {
            "dName": "北京东方华正汽车销售服务有限公司",
            "dCode": "S711010"
        }, {
            "dName": "北京市良乡万达工贸有限公司",
            "dCode": "S711017"
        }, {
            "dName": "北京硕川汽车销售服务有限公司",
            "dCode": "S711024"
        }, {
            "dName": "北京博瑞祥恒汽车销售有限公司",
            "dCode": "S711054"
        }, {
            "dName": "北京捷亚泰汽贸有限公司",
            "dCode": "S911029"
        }, {
            "dName": "北京鑫港汇众汽车销售服务有限公司",
            "dCode": "S711062"
        }]
    }]
}, {
    "pId": 6,
    "pName": "天津",
    "Cities": [{
        "cId": 58,
        "cName": "天津",
        "Dealers": [{
            "dName": "天津市捷兴汽车商贸有限公司",
            "dCode": "S712005"
        }, {
            "dName": "天津捷众汽车销售有限公司",
            "dCode": "S712006"
        }, {
            "dName": "天津诚信通汽车销售有限公司",
            "dCode": "S712007"
        }, {
            "dName": "天津庞大一众汽车销售服务有限公司",
            "dCode": "S712008"
        }, {
            "dName": "天津捷锐汽车销售有限公司",
            "dCode": "S712010"
        }, {
            "dName": "天津捷拓汽车销售服务有限公司",
            "dCode": "S712015"
        }, {
            "dName": "天津市捷世通汽车贸易有限公司",
            "dCode": "S712003"
        }, {
            "dName": "天津浩众汽车贸易服务有限公司",
            "dCode": "S712004"
        }, {
            "dName": "天津捷通汽车销售有限公司",
            "dCode": "S912003"
        }, {
            "dName": "天津海联力通汽车销售服务有限公司",
            "dCode": "S712009"
        }, {
            "dName": "天津市澎众汽车贸易服务有限公司",
            "dCode": "S712013"
        }, {
            "dName": "天津市捷茂通汽车销售有限公司",
            "dCode": "S712012"
        }, {
            "dName": "天津博兴亚泰汽车销售服务有限公司",
            "dCode": "S712014"
        }, {
            "dName": "天津华世通汽车销售有限公司",
            "dCode": "S253001"
        }]
    }, {
        "cId": 59,
        "cName": "西青",
        "Dealers": [{
            "dName": "天津华泰通汽车销售有限公司",
            "dCode": "S712011"
        }]
    }]
}, {
    "pId": 7,
    "pName": "河北",
    "Cities": [{
        "cId": 60,
        "cName": "张家口",
        "Dealers": [{
            "dName": "张家口市庞大一众汽车销售有限公司",
            "dCode": "S713031"
        }, {
            "dName": "张家口市庞大众腾汽车销售有限公司",
            "dCode": "S713050"
        }]
    }, {
        "cId": 61,
        "cName": "保定",
        "Dealers": [{
            "dName": "保定市朗尊汽车销售服务有限公司",
            "dCode": "S713038"
        }, {
            "dName": "保定市中冀汽车贸易集团有限公司",
            "dCode": "S713017"
        }, {
            "dName": "保定轩宇俊鹏汽车销售服务有限公司",
            "dCode": "S713032"
        }, {
            "dName": "保定市耀达正博汽车销售服务有限公司",
            "dCode": "S713053"
        }]
    }, {
        "cId": 62,
        "cName": "石家庄",
        "Dealers": [{
            "dName": "石家庄市庞大一众汽车销售有限公司",
            "dCode": "S713039"
        }, {
            "dName": "石家庄晨阳和众汽车贸易有限公司",
            "dCode": "S713042"
        }, {
            "dName": "河北世纪汽车贸易有限公司",
            "dCode": "S713011"
        }, {
            "dName": "石家庄晨阳汽车贸易有限公司",
            "dCode": "S713018"
        }, {
            "dName": "河北众捷汽车贸易有限公司",
            "dCode": "S713025"
        }, {
            "dName": "石家庄市冀中汽车贸易有限公司",
            "dCode": "S713027"
        }]
    }, {
        "cId": 63,
        "cName": "定州",
        "Dealers": [{
            "dName": "定州轩宇俊鹏汽车销售服务有限公司",
            "dCode": "S713054"
        }]
    }, {
        "cId": 64,
        "cName": "正定",
        "Dealers": [{
            "dName": "石家庄晨阳详云汽车贸易有限公司",
            "dCode": "S713058"
        }]
    }, {
        "cId": 65,
        "cName": "辛集",
        "Dealers": [{
            "dName": "辛集市车是客汽车贸易有限公司",
            "dCode": "S713057"
        }]
    }, {
        "cId": 66,
        "cName": "高碑店",
        "Dealers": [{
            "dName": "高碑店市新海轿车销售有限公司",
            "dCode": "S213011"
        }]
    }, {
        "cId": 67,
        "cName": "晋州",
        "Dealers": [{
            "dName": "石家庄晨阳博众汽车贸易有限公司",
            "dCode": "S213016"
        }]
    }, {
        "cId": 68,
        "cName": "藁城",
        "Dealers": [{
            "dName": "石家庄晨阳汇众汽车贸易有限公司",
            "dCode": "S213017"
        }]
    }, {
        "cId": 69,
        "cName": "秦皇岛",
        "Dealers": [{
            "dName": "秦皇岛市庞大一众汽车销售有限公司",
            "dCode": "S713029"
        }, {
            "dName": "秦皇岛新源汽车销售维修有限公司",
            "dCode": "S713004"
        }]
    }, {
        "cId": 70,
        "cName": "承德",
        "Dealers": [{
            "dName": "承德市庞大一众汽车销售有限公司",
            "dCode": "S713030"
        }]
    }, {
        "cId": 71,
        "cName": "遵化",
        "Dealers": [{
            "dName": "遵化市庞大一众汽车销售有限公司",
            "dCode": "S713037"
        }]
    }, {
        "cId": 72,
        "cName": "唐山",
        "Dealers": [{
            "dName": "唐山市庞大一众汽车销售有限公司",
            "dCode": "S713034"
        }, {
            "dName": "唐山市庞大众跃汽车销售服务有限公司",
            "dCode": "S713045"
        }, {
            "dName": "唐山市冀东汽车销售有限公司",
            "dCode": "S713005"
        }, {
            "dName": "唐山朗基伦汽车销售有限公司",
            "dCode": "S713016"
        }, {
            "dName": "唐山市富瑞汽车贸易有限公司",
            "dCode": "S713056"
        }]
    }, {
        "cId": 73,
        "cName": "迁安",
        "Dealers": [{
            "dName": "迁安市庞大一众汽车销售有限公司",
            "dCode": "S713036"
        }]
    }, {
        "cId": 74,
        "cName": "滦县",
        "Dealers": [{
            "dName": "滦县庞大一众汽车销售有限公司",
            "dCode": "S713049"
        }]
    }, {
        "cId": 75,
        "cName": "廊坊",
        "Dealers": [{
            "dName": "廊坊市庞大一众汽车销售服务有限公司",
            "dCode": "S713044"
        }, {
            "dName": "廊坊市冀东汽车销售有限公司",
            "dCode": "S713009"
        }]
    }, {
        "cId": 76,
        "cName": "玉田",
        "Dealers": [{
            "dName": "玉田县庞大一众汽车销售有限公司",
            "dCode": "S713051"
        }]
    }, {
        "cId": 77,
        "cName": "霸州",
        "Dealers": [{
            "dName": "霸州市云海汽车销售服务有限公司",
            "dCode": "S713059"
        }]
    }, {
        "cId": 78,
        "cName": "三河",
        "Dealers": [{
            "dName": "三河巨丰弘迪汽车维修服务有限公司",
            "dCode": "S213003"
        }]
    }, {
        "cId": 79,
        "cName": "青龙",
        "Dealers": [{
            "dName": "青龙满族自治县庞大一众汽车销售有限公司",
            "dCode": "S213005"
        }]
    }, {
        "cId": 80,
        "cName": "滦南",
        "Dealers": [{
            "dName": "滦南荣川朗基伦汽车销售有限公司",
            "dCode": "S213006"
        }]
    }, {
        "cId": 81,
        "cName": "乐亭",
        "Dealers": [{
            "dName": "乐亭县荣川朗基伦汽车销售有限公司",
            "dCode": "S213014"
        }]
    }, {
        "cId": 82,
        "cName": "大城",
        "Dealers": [{
            "dName": "大城县亿龙汽车销售有限公司",
            "dCode": "S213012"
        }]
    }, {
        "cId": 83,
        "cName": "邯郸",
        "Dealers": [{
            "dName": "邯郸市华迈汽车销售服务有限公司",
            "dCode": "S713033"
        }, {
            "dName": "邯郸市华信泰达汽车贸易有限公司",
            "dCode": "S713026"
        }, {
            "dName": "邯郸市华信进贤汽车贸易有限公司",
            "dCode": "S713041"
        }, {
            "dName": "邯郸市华锦汽车销售服务有限公司",
            "dCode": "S713048"
        }, {
            "dName": "邯郸市帅祺汽车贸易有限公司",
            "dCode": "S213001"
        }]
    }, {
        "cId": 84,
        "cName": "邢台",
        "Dealers": [{
            "dName": "邢台瑞龙汽车服务有限公司",
            "dCode": "S713035"
        }, {
            "dName": "邢台亿龙汽车销售服务有限公司",
            "dCode": "S713022"
        }, {
            "dName": "邢台阔龙汽车销售服务有限公司",
            "dCode": "S713043"
        }]
    }, {
        "cId": 85,
        "cName": "衡水",
        "Dealers": [{
            "dName": "衡水瑞龙汽车销售服务有限公司",
            "dCode": "S713047"
        }, {
            "dName": "衡水烨通汽贸有限公司",
            "dCode": "S713019"
        }, {
            "dName": "衡水恒德安发汽车销售有限公司",
            "dCode": "S213002"
        }]
    }, {
        "cId": 86,
        "cName": "沧州",
        "Dealers": [{
            "dName": "沧州庞大一众汽车销售有限公司",
            "dCode": "S713046"
        }, {
            "dName": "沧州运通汽车销售服务有限公司",
            "dCode": "S713021"
        }, {
            "dName": "沧州市瑞华汽车贸易有限公司",
            "dCode": "S713052"
        }]
    }, {
        "cId": 87,
        "cName": "武安",
        "Dealers": [{
            "dName": "邯郸市顺达汽车贸易有限公司",
            "dCode": "S713020"
        }]
    }, {
        "cId": 88,
        "cName": "任丘",
        "Dealers": [{
            "dName": "任丘市瑞丰建筑有限公司",
            "dCode": "S913006"
        }]
    }, {
        "cId": 89,
        "cName": "黄骅",
        "Dealers": [{
            "dName": "黄骅市前进汽车服务有限公司",
            "dCode": "S713055"
        }]
    }, {
        "cId": 90,
        "cName": "枣强",
        "Dealers": [{
            "dName": "衡水阔龙汽车销售服务有限公司",
            "dCode": "S213008"
        }]
    }, {
        "cId": 91,
        "cName": "河间",
        "Dealers": [{
            "dName": "河间市润众达汽车销售服务有限公司",
            "dCode": "S213007"
        }]
    }, {
        "cId": 92,
        "cName": "清河",
        "Dealers": [{
            "dName": "清河县惠龙汽车销售服务有限公司",
            "dCode": "S213018"
        }]
    }, {
        "cId": 93,
        "cName": "永年",
        "Dealers": [{
            "dName": "永年县瑞龙汽车销售服务有限公司",
            "dCode": "S213013"
        }]
    }, {
        "cId": 94,
        "cName": "泊头",
        "Dealers": [{
            "dName": "泊头市运东汽车销售服务有限公司",
            "dCode": "S213019"
        }]
    }, {
        "cId": 95,
        "cName": "磁县",
        "Dealers": [{
            "dName": "磁县万合汽车贸易有限公司",
            "dCode": "S213015"
        }]
    }]
}, {
    "pId": 8,
    "pName": "山西",
    "Cities": [{
        "cId": 96,
        "cName": "忻州",
        "Dealers": [{
            "dName": "山西信鹏汽车销售服务有限公司",
            "dCode": "S714018"
        }]
    }, {
        "cId": 97,
        "cName": "阳泉",
        "Dealers": [{
            "dName": "阳泉市庞大一众汽车销售有限公司",
            "dCode": "S714022"
        }]
    }, {
        "cId": 98,
        "cName": "长治",
        "Dealers": [{
            "dName": "长治市中天汽车销售服务有限公司",
            "dCode": "S714023"
        }, {
            "dName": "山西省长治市飞路汽车贸易有限公司",
            "dCode": "S714013"
        }]
    }, {
        "cId": 99,
        "cName": "吕梁",
        "Dealers": [{
            "dName": "山西吕梁大昌众达汽车服务有限公司",
            "dCode": "S714024"
        }]
    }, {
        "cId": 100,
        "cName": "大同",
        "Dealers": [{
            "dName": "庞大大同南郊一众汽车销售有限公司",
            "dCode": "S714025"
        }, {
            "dName": "大同市谷氏车城汽车连锁销售有限公司",
            "dCode": "S714014"
        }]
    }, {
        "cId": 101,
        "cName": "太原",
        "Dealers": [{
            "dName": "山西大昌通源汽车销售服务有限公司",
            "dCode": "S714026"
        }, {
            "dName": "山西志国星赛车发展有限公司",
            "dCode": "S714009"
        }, {
            "dName": "山西中汽贸联汽车销售有限公司",
            "dCode": "S714016"
        }, {
            "dName": "山西大昌轿车销售服务有限公司",
            "dCode": "S714019"
        }]
    }, {
        "cId": 102,
        "cName": "晋城",
        "Dealers": [{
            "dName": "晋城市唐荣实业有限公司",
            "dCode": "S714010"
        }]
    }, {
        "cId": 103,
        "cName": "朔州",
        "Dealers": [{
            "dName": "朔州市双良汽车有限公司",
            "dCode": "S714017"
        }]
    }, {
        "cId": 104,
        "cName": "运城",
        "Dealers": [{
            "dName": "运城市通达汽车销售服务有限公司",
            "dCode": "S714021"
        }, {
            "dName": "山西诺维兰集团运城瑞众汽车销售服务有限公司",
            "dCode": "S714028"
        }]
    }, {
        "cId": 105,
        "cName": "晋中",
        "Dealers": [{
            "dName": "晋中航成轿车销售服务有限公司",
            "dCode": "S714027"
        }]
    }, {
        "cId": 106,
        "cName": "临汾",
        "Dealers": [{
            "dName": "临汾天健国风汽车销售服务有限公司",
            "dCode": "S714030"
        }]
    }, {
        "cId": 107,
        "cName": "盂县",
        "Dealers": [{
            "dName": "盂县鑫众汽车销售有限公司",
            "dCode": "S214001"
        }]
    }, {
        "cId": 108,
        "cName": "河津",
        "Dealers": [{
            "dName": "山西诺维兰集团河津市瑞腾汽车销售服务有限公司",
            "dCode": "S214003"
        }]
    }, {
        "cId": 109,
        "cName": "孝义",
        "Dealers": [{
            "dName": "孝义市德众汽贸有限公司",
            "dCode": "S214004"
        }]
    }, {
        "cId": 110,
        "cName": "临猗",
        "Dealers": [{
            "dName": "山西诺维兰集团临猗瑞捷汽车销售服务有限公司",
            "dCode": "S214002"
        }]
    }]
}, {
    "pId": 9,
    "pName": "山东",
    "Cities": [{
        "cId": 111,
        "cName": "济南",
        "Dealers": [{
            "dName": "山东首佳汽车销售服务有限公司",
            "dCode": "S737061"
        }, {
            "dName": "山东金宝利汽车销售服务有限公司",
            "dCode": "S737071"
        }, {
            "dName": "山东银座汽车贸易有限公司",
            "dCode": "S637009"
        }, {
            "dName": "山东润捷汽车销售服务有限公司",
            "dCode": "S737050"
        }, {
            "dName": "济南庞大一众汽车销售服务有限公司",
            "dCode": "S737084"
        }]
    }, {
        "cId": 112,
        "cName": "滨州",
        "Dealers": [{
            "dName": "滨州腾翔汽车销售服务有限公司",
            "dCode": "S737072"
        }, {
            "dName": "山东滨州宝捷汽车销售服务有限公司",
            "dCode": "S737051"
        }]
    }, {
        "cId": 113,
        "cName": "德州",
        "Dealers": [{
            "dName": "德州汇众汽车销售技术服务有限公司",
            "dCode": "S737030"
        }, {
            "dName": "德州华运汽贸销售服务有限公司",
            "dCode": "S737048"
        }]
    }, {
        "cId": 114,
        "cName": "东营",
        "Dealers": [{
            "dName": "东营华锐汽车销售有限公司",
            "dCode": "S737062"
        }]
    }, {
        "cId": 115,
        "cName": "广饶",
        "Dealers": [{
            "dName": "山东广饶腾翔汽车销售服务有限公司",
            "dCode": "S737093"
        }]
    }, {
        "cId": 116,
        "cName": "无棣",
        "Dealers": [{
            "dName": "山东无棣腾翔汽车销售服务有限公司",
            "dCode": "S237002"
        }]
    }, {
        "cId": 117,
        "cName": "齐河",
        "Dealers": [{
            "dName": "齐河华腾汽车销售有限公司",
            "dCode": "S237001"
        }]
    }, {
        "cId": 118,
        "cName": "夏津",
        "Dealers": [{
            "dName": "夏津汇达汽车销售有限公司",
            "dCode": "S237012"
        }]
    }, {
        "cId": 119,
        "cName": "乐陵",
        "Dealers": [{
            "dName": "乐陵市鑫众汽车销售服务有限公司",
            "dCode": "S237013"
        }]
    }, {
        "cId": 120,
        "cName": "惠民",
        "Dealers": [{
            "dName": "滨州泰通汽车销售服务有限公司",
            "dCode": "S237017"
        }]
    }, {
        "cId": 121,
        "cName": "新泰",
        "Dealers": [{
            "dName": "新泰市创新汽车服务有限公司",
            "dCode": "S737057"
        }]
    }, {
        "cId": 122,
        "cName": "聊城",
        "Dealers": [{
            "dName": "聊城北斗泰众汽车销售有限公司",
            "dCode": "S737075"
        }, {
            "dName": "聊城交运集团汽车销售服务有限责任公司",
            "dCode": "S737038"
        }]
    }, {
        "cId": 123,
        "cName": "泰安",
        "Dealers": [{
            "dName": "泰安仁博汽车销售有限公司",
            "dCode": "S737080"
        }, {
            "dName": "泰安中租汽车贸易有限公司",
            "dCode": "S737035"
        }]
    }, {
        "cId": 124,
        "cName": "济宁",
        "Dealers": [{
            "dName": "济宁众诚汽车销售服务有限公司",
            "dCode": "S737058"
        }, {
            "dName": "济宁世盛汽车销售服务有限公司",
            "dCode": "S737076"
        }, {
            "dName": "济宁市长济汽车贸易有限公司",
            "dCode": "S737031"
        }]
    }, {
        "cId": 125,
        "cName": "菏泽",
        "Dealers": [{
            "dName": "菏泽交通集团有限公司",
            "dCode": "S737085"
        }, {
            "dName": "菏泽金江车业有限公司",
            "dCode": "S737086"
        }]
    }, {
        "cId": 126,
        "cName": "邹城",
        "Dealers": [{
            "dName": "济宁交运怡丰汽车销售服务有限公司",
            "dCode": "S737087"
        }]
    }, {
        "cId": 127,
        "cName": "茌平",
        "Dealers": [{
            "dName": "茌平德众汽车销售服务有限公司",
            "dCode": "S737088"
        }]
    }, {
        "cId": 128,
        "cName": "肥城",
        "Dealers": [{
            "dName": "肥城市创伟汽车服务有限公司",
            "dCode": "S237016"
        }]
    }, {
        "cId": 129,
        "cName": "郓城",
        "Dealers": [{
            "dName": "郓城德众汽车销售服务有限公司",
            "dCode": "S237019"
        }]
    }, {
        "cId": 130,
        "cName": "莱芜",
        "Dealers": [{
            "dName": "莱芜泰通汽车销售服务有限公司",
            "dCode": "S737037"
        }]
    }, {
        "cId": 131,
        "cName": "青州",
        "Dealers": [{
            "dName": "青州宝悦汽车销售服务有限公司",
            "dCode": "S737065"
        }]
    }, {
        "cId": 132,
        "cName": "寿光",
        "Dealers": [{
            "dName": "寿光富泓汽车销售服务有限公司",
            "dCode": "S737068"
        }]
    }, {
        "cId": 133,
        "cName": "淄博",
        "Dealers": [{
            "dName": "淄博唯达长齐汽车销售有限公司",
            "dCode": "S737069"
        }, {
            "dName": "淄博骏泰汽车销售服务有限公司",
            "dCode": "S737079"
        }, {
            "dName": "淄博市久期汽车销售有限公司",
            "dCode": "S737015"
        }, {
            "dName": "淄博众信汽车销售服务有限公司",
            "dCode": "S737040"
        }]
    }, {
        "cId": 134,
        "cName": "诸城",
        "Dealers": [{
            "dName": "诸城市永邦汽车服务有限公司",
            "dCode": "S737066"
        }]
    }, {
        "cId": 135,
        "cName": "临朐",
        "Dealers": [{
            "dName": "临朐广潍顺达汽车销售服务有限公司",
            "dCode": "S737078"
        }]
    }, {
        "cId": 136,
        "cName": "高密",
        "Dealers": [{
            "dName": "高密市经贸汽车销售有限公司",
            "dCode": "S737028"
        }]
    }, {
        "cId": 137,
        "cName": "潍坊",
        "Dealers": [{
            "dName": "潍坊市鑫达汽车贸易有限公司",
            "dCode": "S737036"
        }, {
            "dName": "潍坊广潍发达商贸有限公司",
            "dCode": "S737039"
        }]
    }, {
        "cId": 138,
        "cName": "昌邑",
        "Dealers": [{
            "dName": "昌邑广潍金达汽车销售服务有限公司",
            "dCode": "S737089"
        }]
    }, {
        "cId": 139,
        "cName": "安丘",
        "Dealers": [{
            "dName": "安丘广利汽车贸易有限公司",
            "dCode": "S737095"
        }]
    }, {
        "cId": 140,
        "cName": "桓台",
        "Dealers": [{
            "dName": "淄博捷通汽车销售服务有限公司",
            "dCode": "S237021"
        }]
    }, {
        "cId": 141,
        "cName": "临沂",
        "Dealers": [{
            "dName": "临沂东华汽车销售服务有限公司",
            "dCode": "S737067"
        }, {
            "dName": "临沂久华汽车销售服务有限公司",
            "dCode": "S737081"
        }, {
            "dName": "临沂佳轮汽车销售服务有限公司",
            "dCode": "S737029"
        }, {
            "dName": "临沂大华汽车销售服务有限公司",
            "dCode": "S737064"
        }]
    }, {
        "cId": 142,
        "cName": "枣庄",
        "Dealers": [{
            "dName": "山东永正集团东联汽车城有限公司",
            "dCode": "S737070"
        }, {
            "dName": "枣庄永明汽车销售服务有限公司",
            "dCode": "S737097"
        }]
    }, {
        "cId": 143,
        "cName": "日照",
        "Dealers": [{
            "dName": "日照市腾达众晟汽车销售服务有限公司",
            "dCode": "S737082"
        }, {
            "dName": "日照市众达汽车销售服务有限公司",
            "dCode": "S737073"
        }]
    }, {
        "cId": 144,
        "cName": "苍山",
        "Dealers": [{
            "dName": "兰陵大华汽车销售服务有限公司",
            "dCode": "S237022"
        }]
    }, {
        "cId": 145,
        "cName": "临沭",
        "Dealers": [{
            "dName": "临沭东华汽车销售服务有限公司",
            "dCode": "S237005"
        }]
    }, {
        "cId": 146,
        "cName": "费县",
        "Dealers": [{
            "dName": "费县大华汽车销售服务有限公司",
            "dCode": "S237003"
        }]
    }, {
        "cId": 147,
        "cName": "郯城",
        "Dealers": [{
            "dName": "郯城大华汽车销售服务有限公司",
            "dCode": "S237004"
        }]
    }, {
        "cId": 148,
        "cName": "沂南",
        "Dealers": [{
            "dName": "沂南大华汽车销售服务有限公司",
            "dCode": "S237008"
        }]
    }, {
        "cId": 149,
        "cName": "沂水",
        "Dealers": [{
            "dName": "沂水大华汽车销售服务有限公司",
            "dCode": "S237011"
        }]
    }, {
        "cId": 150,
        "cName": "平邑",
        "Dealers": [{
            "dName": "平邑大华汽车销售服务有限公司",
            "dCode": "S237010"
        }]
    }, {
        "cId": 151,
        "cName": "莒县",
        "Dealers": [{
            "dName": "莒县众合汽车销售服务有限公司",
            "dCode": "S237014"
        }]
    }, {
        "cId": 152,
        "cName": "青岛",
        "Dealers": [{
            "dName": "青岛迪生源汽车销售服务有限公司",
            "dCode": "S737054"
        }, {
            "dName": "青岛大栏汽车销售有限公司",
            "dCode": "S737032"
        }, {
            "dName": "青岛华世通实业发展有限公司",
            "dCode": "S737059"
        }]
    }, {
        "cId": 153,
        "cName": "即墨",
        "Dealers": [{
            "dName": "青岛亨通汽车销售服务有限公司",
            "dCode": "S737053"
        }]
    }, {
        "cId": 154,
        "cName": "威海",
        "Dealers": [{
            "dName": "威海中升汇众汽车销售服务有限公司",
            "dCode": "S737098"
        }]
    }, {
        "cId": 155,
        "cName": "荣成",
        "Dealers": [{
            "dName": "荣成市众奥达汽车销售服务有限公司",
            "dCode": "S737077"
        }]
    }, {
        "cId": 156,
        "cName": "莱州",
        "Dealers": [{
            "dName": "莱州市鸿富汽车经销有限公司",
            "dCode": "S737006"
        }]
    }, {
        "cId": 157,
        "cName": "烟台",
        "Dealers": [{
            "dName": "烟台东联汽车销售有限公司",
            "dCode": "S737016"
        }, {
            "dName": "烟台市大成汽车销售有限公司",
            "dCode": "S737018"
        }]
    }, {
        "cId": 158,
        "cName": "龙口",
        "Dealers": [{
            "dName": "山东龙口富龙汽车有限公司",
            "dCode": "S737017"
        }]
    }, {
        "cId": 159,
        "cName": "招远",
        "Dealers": [{
            "dName": "招远市天城汽车维修有限公司",
            "dCode": "S737042"
        }]
    }, {
        "cId": 160,
        "cName": "莱阳",
        "Dealers": [{
            "dName": "烟台瑞源汽车销售有限公司",
            "dCode": "S737043"
        }]
    }, {
        "cId": 161,
        "cName": "黄岛",
        "Dealers": [{
            "dName": "青岛庞大一众汽车销售有限公司",
            "dCode": "S737083"
        }]
    }, {
        "cId": 162,
        "cName": "平度",
        "Dealers": [{
            "dName": "青岛亨联汽车销售有限公司",
            "dCode": "S737090"
        }]
    }, {
        "cId": 163,
        "cName": "胶南",
        "Dealers": [{
            "dName": "青岛瑞辰汽车销售服务有限公司",
            "dCode": "S737094"
        }]
    }, {
        "cId": 164,
        "cName": "莱西",
        "Dealers": [{
            "dName": "青岛莱西市瑞富春汽车销售服务有限公司",
            "dCode": "S237007"
        }]
    }, {
        "cId": 165,
        "cName": "海阳",
        "Dealers": [{
            "dName": "海阳市瑞富春汽车销售服务有限公司",
            "dCode": "S237009"
        }]
    }, {
        "cId": 166,
        "cName": "乳山",
        "Dealers": [{
            "dName": "乳山中升汇众汽车销售服务有限公司",
            "dCode": "S237015"
        }]
    }]
}, {
    "pId": 10,
    "pName": "河南",
    "Cities": [{
        "cId": 167,
        "cName": "郑州",
        "Dealers": [{
            "dName": "河南润众实业有限公司",
            "dCode": "S741022"
        }, {
            "dName": "河南合众明德汽车销售服务有限公司",
            "dCode": "S741031"
        }, {
            "dName": "河南万通一汽贸易有限公司",
            "dCode": "S741004"
        }, {
            "dName": "河南裕华奥捷汽车销售服务有限公司",
            "dCode": "S741008"
        }, {
            "dName": "河南豫港华翔汽车销售服务有限公司",
            "dCode": "S741012"
        }, {
            "dName": "河南合众汇金实业有限公司",
            "dCode": "S741018"
        }, {
            "dName": "郑州东佳汽车销售服务有限责任公司",
            "dCode": "S741033"
        }]
    }, {
        "cId": 168,
        "cName": "鹤壁",
        "Dealers": [{
            "dName": "鹤壁维尔娜汽车销售有限公司",
            "dCode": "S741029"
        }]
    }, {
        "cId": 169,
        "cName": "新乡",
        "Dealers": [{
            "dName": "新乡市世通汽车贸易有限责任公司",
            "dCode": "S741009"
        }, {
            "dName": "新乡市坤丰汽车销售有限公司",
            "dCode": "S741032"
        }]
    }, {
        "cId": 170,
        "cName": "焦作",
        "Dealers": [{
            "dName": "焦作市云洲汽车贸易有限公司",
            "dCode": "S741010"
        }, {
            "dName": "焦作国安汽车有限公司",
            "dCode": "S741039"
        }]
    }, {
        "cId": 171,
        "cName": "安阳",
        "Dealers": [{
            "dName": "安阳市宝捷汽车贸易有限责任公司",
            "dCode": "S741013"
        }, {
            "dName": "安阳市世达汽车销售服务有限公司",
            "dCode": "S741030"
        }]
    }, {
        "cId": 172,
        "cName": "濮阳",
        "Dealers": [{
            "dName": "濮阳市宝捷汽车销售服务有限公司",
            "dCode": "S741015"
        }]
    }, {
        "cId": 173,
        "cName": "开封",
        "Dealers": [{
            "dName": "开封市万宝汽车贸易有限公司",
            "dCode": "S741016"
        }, {
            "dName": "开封万宝汽车销售服务有限公司",
            "dCode": "S741037"
        }]
    }, {
        "cId": 174,
        "cName": "巩义",
        "Dealers": [{
            "dName": "巩义合众汇金汽车销售服务有限公司",
            "dCode": "S741036"
        }]
    }, {
        "cId": 175,
        "cName": "新密",
        "Dealers": [{
            "dName": "新密恒信众联汽车销售服务有限公司",
            "dCode": "S741041"
        }]
    }, {
        "cId": 176,
        "cName": "长垣",
        "Dealers": [{
            "dName": "长垣世通汽车贸易有限公司",
            "dCode": "S241002"
        }]
    }, {
        "cId": 177,
        "cName": "滑县",
        "Dealers": [{
            "dName": "滑县锦程汽车销售服务有限公司",
            "dCode": "S241008"
        }]
    }, {
        "cId": 178,
        "cName": "中牟",
        "Dealers": [{
            "dName": "郑州庞大一众汽车销售有限公司",
            "dCode": "S241003"
        }]
    }, {
        "cId": 179,
        "cName": "辉县",
        "Dealers": [{
            "dName": "辉县市世通汽车销售有限公司",
            "dCode": "S241009"
        }]
    }, {
        "cId": 180,
        "cName": "林州",
        "Dealers": [{
            "dName": "林州德众汽车销售服务有限公司",
            "dCode": "S241007"
        }]
    }, {
        "cId": 181,
        "cName": "商丘",
        "Dealers": [{
            "dName": "商丘市众捷汽车销售有限公司",
            "dCode": "S841002"
        }]
    }, {
        "cId": 182,
        "cName": "驻马店",
        "Dealers": [{
            "dName": "驻马店市和美汽车销售服务有限公司",
            "dCode": "S741024"
        }]
    }, {
        "cId": 183,
        "cName": "平顶山",
        "Dealers": [{
            "dName": "平顶山市华天汽车销售服务有限公司",
            "dCode": "S741020"
        }, {
            "dName": "平顶山吉祥地汽车销售有限公司",
            "dCode": "S741035"
        }]
    }, {
        "cId": 184,
        "cName": "周口",
        "Dealers": [{
            "dName": "周口市和荣汽车销售服务有限公司",
            "dCode": "S741026"
        }]
    }, {
        "cId": 185,
        "cName": "南阳",
        "Dealers": [{
            "dName": "南阳众业汽车有限公司",
            "dCode": "S741027"
        }]
    }, {
        "cId": 186,
        "cName": "三门峡",
        "Dealers": [{
            "dName": "三门峡九都汽车有限公司",
            "dCode": "S741025"
        }]
    }, {
        "cId": 187,
        "cName": "信阳",
        "Dealers": [{
            "dName": "信阳合众汇金汽车销售服务有限公司",
            "dCode": "S741028"
        }]
    }, {
        "cId": 188,
        "cName": "洛阳",
        "Dealers": [{
            "dName": "洛阳开元汽车销售服务有限公司",
            "dCode": "S741023"
        }, {
            "dName": "洛阳伯乐汽车有限公司",
            "dCode": "S741005"
        }, {
            "dName": "洛阳吉众汽车有限公司",
            "dCode": "S741034"
        }, {
            "dName": "洛阳盛业汽车有限公司",
            "dCode": "S241001"
        }]
    }, {
        "cId": 189,
        "cName": "漯河",
        "Dealers": [{
            "dName": "漯河市宝捷汽车销售服务有限公司",
            "dCode": "S741011"
        }]
    }, {
        "cId": 190,
        "cName": "许昌",
        "Dealers": [{
            "dName": "许昌恒业汽车销售有限公司",
            "dCode": "S741014"
        }]
    }, {
        "cId": 191,
        "cName": "济源",
        "Dealers": [{
            "dName": "济源市永嘉汽车销售有限公司",
            "dCode": "S741040"
        }]
    }, {
        "cId": 192,
        "cName": "灵宝",
        "Dealers": [{
            "dName": "灵宝众诚汽车销售服务有限公司",
            "dCode": "S741042"
        }]
    }, {
        "cId": 193,
        "cName": "永城",
        "Dealers": [{
            "dName": "永城市华瑞汽车销售有限公司",
            "dCode": "S241004"
        }]
    }, {
        "cId": 194,
        "cName": "虞城",
        "Dealers": [{
            "dName": "虞城县众捷汽车贸易物流有限公司",
            "dCode": "S241006"
        }]
    }, {
        "cId": 195,
        "cName": "长葛",
        "Dealers": [{
            "dName": "长葛市恒业汽车销售有限公司",
            "dCode": "S241005"
        }]
    }, {
        "cId": 196,
        "cName": "禹州",
        "Dealers": [{
            "dName": "禹州恒业汽车销售有限公司",
            "dCode": "S241010"
        }]
    }]
}, {
    "pId": 11,
    "pName": "湖北",
    "Cities": [{
        "cId": 197,
        "cName": "黄石",
        "Dealers": [{
            "dName": "黄石市大桥汽车服务有限公司",
            "dCode": "S942022"
        }]
    }, {
        "cId": 198,
        "cName": "孝感",
        "Dealers": [{
            "dName": "孝感国富汽车销售服务有限公司",
            "dCode": "S942026"
        }]
    }, {
        "cId": 199,
        "cName": "咸宁",
        "Dealers": [{
            "dName": "咸宁恒信众联汽车销售服务有限公司",
            "dCode": "S942028"
        }]
    }, {
        "cId": 200,
        "cName": "黄冈",
        "Dealers": [{
            "dName": "黄冈恒信众联汽车销售服务有限公司",
            "dCode": "S942030"
        }]
    }, {
        "cId": 201,
        "cName": "武汉",
        "Dealers": [{
            "dName": "武汉富尔汽车销售服务有限公司",
            "dCode": "S942032"
        }, {
            "dName": "武汉一通汽车销售服务有限公司",
            "dCode": "S942015"
        }, {
            "dName": "武汉康顺集团汽车贸易有限公司",
            "dCode": "S942016"
        }, {
            "dName": "湖北东富汽车工贸有限公司",
            "dCode": "S942017"
        }, {
            "dName": "武汉恒信众联汽车销售服务有限公司",
            "dCode": "S942034"
        }, {
            "dName": "武汉东富优诚汽车销售服务有限公司",
            "dCode": "S942036"
        }]
    }, {
        "cId": 202,
        "cName": "鄂州",
        "Dealers": [{
            "dName": "鄂州锦坤汽车销售服务有限公司",
            "dCode": "S942038"
        }]
    }, {
        "cId": 203,
        "cName": "潜江",
        "Dealers": [{
            "dName": "潜江恒信众联汽车销售服务有限公司",
            "dCode": "S242002"
        }]
    }, {
        "cId": 204,
        "cName": "宜昌",
        "Dealers": [{
            "dName": "宜昌德顺汽车销售服务有限公司",
            "dCode": "S942023"
        }]
    }, {
        "cId": 205,
        "cName": "荆州",
        "Dealers": [{
            "dName": "荆州市恒信一路汽车销售服务有限公司",
            "dCode": "S942024"
        }]
    }, {
        "cId": 206,
        "cName": "十堰",
        "Dealers": [{
            "dName": "湖北十堰东富汽车销售服务有限公司",
            "dCode": "S942027"
        }]
    }, {
        "cId": 207,
        "cName": "恩施市",
        "Dealers": [{
            "dName": "恩施恒信众联汽车销售服务有限公司",
            "dCode": "S942025"
        }]
    }, {
        "cId": 208,
        "cName": "荆门",
        "Dealers": [{
            "dName": "荆门恒信众联汽车销售服务有限公司",
            "dCode": "S942029"
        }]
    }, {
        "cId": 209,
        "cName": "襄阳",
        "Dealers": [{
            "dName": "襄阳恒信众联汽车销售服务有限公司",
            "dCode": "S942035"
        }, {
            "dName": "襄阳华骏汽车销售服务有限公司",
            "dCode": "S942031"
        }]
    }, {
        "cId": 210,
        "cName": "随州",
        "Dealers": [{
            "dName": "随州东富汽车销售服务有限公司",
            "dCode": "S942037"
        }]
    }, {
        "cId": 211,
        "cName": "宜都",
        "Dealers": [{
            "dName": "宜昌都顺汽车贸易有限公司",
            "dCode": "S242001"
        }]
    }]
}, {
    "pId": 12,
    "pName": "上海",
    "Cities": [{
        "cId": 212,
        "cName": "上海",
        "Dealers": [{
            "dName": "上海金旋汽车服务有限公司",
            "dCode": "S732053"
        }, {
            "dName": "上海永达豪捷汽车销售服务有限公司",
            "dCode": "S732056"
        }, {
            "dName": "上海锦腾汽车销售服务有限公司",
            "dCode": "S931015"
        }, {
            "dName": "上海虹湾贸易有限公司",
            "dCode": "S931013"
        }, {
            "dName": "上海慕森汽车销售服务有限公司",
            "dCode": "S931014"
        }, {
            "dName": "上海交运起申汽车销售服务有限公司",
            "dCode": "S931016"
        }, {
            "dName": "上海一汽汽车服务有限公司",
            "dCode": "S931002"
        }, {
            "dName": "上海嘉安汽车销售有限公司",
            "dCode": "S931005"
        }, {
            "dName": "上海永达汽车浦东贸易有限公司",
            "dCode": "S931007"
        }, {
            "dName": "上海开隆汽车服务有限公司",
            "dCode": "S931008"
        }, {
            "dName": "上海宝乐汽车销售服务有限公司",
            "dCode": "S931011"
        }, {
            "dName": "上海华星众捷汽车销售有限公司",
            "dCode": "S931012"
        }, {
            "dName": "上海东联北松汽车销售服务有限公司",
            "dCode": "S931017"
        }, {
            "dName": "上海永达众鑫汽车销售服务有限公司",
            "dCode": "S931018"
        }, {
            "dName": "上海华星鸿捷汽车销售服务有限公司",
            "dCode": "S931020"
        }]
    }]
}, {
    "pId": 13,
    "pName": "江苏",
    "Cities": [{
        "cId": 213,
        "cName": "常州",
        "Dealers": [{
            "dName": "常州市上瑞汽车销售服务有限公司",
            "dCode": "S732052"
        }, {
            "dName": "常州国际汽车城有限公司",
            "dCode": "S732029"
        }, {
            "dName": "常州宝达汽车销售服务有限公司",
            "dCode": "S732038"
        }, {
            "dName": "常州外汽东进汽车销售服务有限公司",
            "dCode": "S732072"
        }]
    }, {
        "cId": 214,
        "cName": "丹阳",
        "Dealers": [{
            "dName": "江苏德大汽车有限公司",
            "dCode": "S732059"
        }]
    }, {
        "cId": 215,
        "cName": "溧阳",
        "Dealers": [{
            "dName": "溧阳宝达汽车销售服务有限公司",
            "dCode": "S732067"
        }]
    }, {
        "cId": 216,
        "cName": "镇江",
        "Dealers": [{
            "dName": "江苏华跃汽车有限公司",
            "dCode": "S732031"
        }, {
            "dName": "镇江德豪汽车有限公司",
            "dCode": "S732071"
        }]
    }, {
        "cId": 217,
        "cName": "无锡",
        "Dealers": [{
            "dName": "无锡宝达汽车销售服务有限公司",
            "dCode": "S732068"
        }, {
            "dName": "无锡东方荣昌汽车销售服务有限公司",
            "dCode": "S732007"
        }, {
            "dName": "无锡市新纪元众友汽车销售服务有限公司",
            "dCode": "S732040"
        }, {
            "dName": "无锡申荣汽车有限公司",
            "dCode": "S932018"
        }]
    }, {
        "cId": 218,
        "cName": "宜兴",
        "Dealers": [{
            "dName": "宜兴市广海元汽车销售服务有限公司",
            "dCode": "S732043"
        }, {
            "dName": "宜兴新东方汽车销售服务有限公司",
            "dCode": "S732084"
        }]
    }, {
        "cId": 219,
        "cName": "江阴",
        "Dealers": [{
            "dName": "江阴市全顺海宏汽车销售服务有限公司",
            "dCode": "S732045"
        }, {
            "dName": "江阴市海隆汽车销售服务有限公司",
            "dCode": "S732083"
        }]
    }, {
        "cId": 220,
        "cName": "金坛",
        "Dealers": [{
            "dName": "金坛宝达汽车销售服务有限公司",
            "dCode": "S732079"
        }]
    }, {
        "cId": 221,
        "cName": "宿迁",
        "Dealers": [{
            "dName": "宿迁大中汽车服务有限公司",
            "dCode": "S732046"
        }]
    }, {
        "cId": 222,
        "cName": "淮安",
        "Dealers": [{
            "dName": "淮安康润汽车销售服务有限公司",
            "dCode": "S732055"
        }]
    }, {
        "cId": 223,
        "cName": "徐州",
        "Dealers": [{
            "dName": "徐州金源汽车服务有限公司",
            "dCode": "S732058"
        }, {
            "dName": "徐州金茂汽车贸易有限公司",
            "dCode": "S732033"
        }, {
            "dName": "徐州联和恒顺汽车销售服务有限公司",
            "dCode": "S732074"
        }]
    }, {
        "cId": 224,
        "cName": "扬州",
        "Dealers": [{
            "dName": "江苏金太阳汽车销售服务有限公司",
            "dCode": "S732037"
        }, {
            "dName": "扬州金通汽车销售服务有限公司",
            "dCode": "S732065"
        }, {
            "dName": "江苏金太阳瑞众汽车贸易有限公司",
            "dCode": "S732078"
        }]
    }, {
        "cId": 225,
        "cName": "南京",
        "Dealers": [{
            "dName": "南京协众东麒汽车有限公司",
            "dCode": "S732051"
        }, {
            "dName": "南京朗驰集团苏润汽车销售服务有限公司",
            "dCode": "S732021"
        }, {
            "dName": "江苏苏舜华德汽车销售服务有限公司",
            "dCode": "S732028"
        }, {
            "dName": "南京协众汽车有限公司",
            "dCode": "S732047"
        }, {
            "dName": "江苏华海南众汽车销售有限公司",
            "dCode": "S732066"
        }, {
            "dName": "南京协众瑞东汽车有限公司",
            "dCode": "S732069"
        }, {
            "dName": "南京东连香江汽车销售服务有限公司",
            "dCode": "S732082"
        }, {
            "dName": "南京江北协众汽车销售服务有限公司",
            "dCode": "S732087"
        }, {
            "dName": "南京溧水协众汽车销售服务有限公司",
            "dCode": "S232015"
        }]
    }, {
        "cId": 226,
        "cName": "沛县",
        "Dealers": [{
            "dName": "徐州金泉汽车贸易有限公司",
            "dCode": "S232001"
        }]
    }, {
        "cId": 227,
        "cName": "睢宁",
        "Dealers": [{
            "dName": "徐州金宇汽车贸易有限公司",
            "dCode": "S232002"
        }]
    }, {
        "cId": 228,
        "cName": "盱眙县",
        "Dealers": [{
            "dName": "淮安驰祥汽车销售服务有限公司",
            "dCode": "S232009"
        }]
    }, {
        "cId": 229,
        "cName": "高邮",
        "Dealers": [{
            "dName": "扬州金沪汽车销售服务有限公司",
            "dCode": "S232006"
        }]
    }, {
        "cId": 230,
        "cName": "沭阳",
        "Dealers": [{
            "dName": "沭阳大中汽车服务有限公司",
            "dCode": "S232003"
        }]
    }, {
        "cId": 231,
        "cName": "仪征",
        "Dealers": [{
            "dName": "扬州金迈汽车销售服务有限公司",
            "dCode": "S232007"
        }]
    }, {
        "cId": 232,
        "cName": "泗洪",
        "Dealers": [{
            "dName": "宿迁中瑞汽车服务有限公司",
            "dCode": "S232014"
        }]
    }, {
        "cId": 233,
        "cName": "新沂",
        "Dealers": [{
            "dName": "新沂大中汽车贸易有限公司",
            "dCode": "S232013"
        }]
    }, {
        "cId": 234,
        "cName": "苏州",
        "Dealers": [{
            "dName": "苏州汇凯汽车贸易有限公司",
            "dCode": "S732036"
        }, {
            "dName": "苏州欧亚伟业实业有限公司",
            "dCode": "S732023"
        }, {
            "dName": "苏州市国懋汽车销售服务有限公司",
            "dCode": "S932014"
        }, {
            "dName": "苏州德诚汽车销售服务有限公司",
            "dCode": "S732080"
        }, {
            "dName": "苏州元通汽车销售服务有限公司",
            "dCode": "S732085"
        }]
    }, {
        "cId": 235,
        "cName": "吴江",
        "Dealers": [{
            "dName": "苏州市德宝车业有限公司",
            "dCode": "S732054"
        }]
    }, {
        "cId": 236,
        "cName": "太仓",
        "Dealers": [{
            "dName": "太仓市森联汽车销售服务有限公司",
            "dCode": "S732060"
        }]
    }, {
        "cId": 237,
        "cName": "常熟",
        "Dealers": [{
            "dName": "常熟德润汽车销售服务有限公司",
            "dCode": "S732070"
        }, {
            "dName": "常熟市众成汽车销售有限公司",
            "dCode": "S732015"
        }]
    }, {
        "cId": 238,
        "cName": "昆山",
        "Dealers": [{
            "dName": "昆山锦隆汽车贸易有限公司",
            "dCode": "S732019"
        }]
    }, {
        "cId": 239,
        "cName": "张家港",
        "Dealers": [{
            "dName": "张家港市汇众汽车销售有限公司",
            "dCode": "S732041"
        }]
    }, {
        "cId": 240,
        "cName": "南通",
        "Dealers": [{
            "dName": "南通鑫湖汽车贸易服务有限公司",
            "dCode": "S732050"
        }, {
            "dName": "南通文峰伟嘉汽车销售服务有限公司",
            "dCode": "S732062"
        }, {
            "dName": "南通新城集团有限公司",
            "dCode": "S732048"
        }, {
            "dName": "南通大生众和汽车销售服务有限公司",
            "dCode": "S732063"
        }]
    }, {
        "cId": 241,
        "cName": "海门",
        "Dealers": [{
            "dName": "海门常和大众汽车销售服务有限公司",
            "dCode": "S732049"
        }]
    }, {
        "cId": 242,
        "cName": "泰州",
        "Dealers": [{
            "dName": "泰州金太阳汽车贸易有限公司",
            "dCode": "S732057"
        }, {
            "dName": "泰州金邦汽车销售服务有限公司",
            "dCode": "S232005"
        }]
    }, {
        "cId": 243,
        "cName": "如皋",
        "Dealers": [{
            "dName": "如皋神州汽车销售服务有限公司",
            "dCode": "S732064"
        }]
    }, {
        "cId": 244,
        "cName": "盐城",
        "Dealers": [{
            "dName": "江苏中联汽车销售服务有限公司",
            "dCode": "S732025"
        }, {
            "dName": "盐城鑫湖贸易有限公司",
            "dCode": "S732061"
        }]
    }, {
        "cId": 245,
        "cName": "连云港",
        "Dealers": [{
            "dName": "连云港康华汽车销售服务有限公司",
            "dCode": "S732032"
        }, {
            "dName": "连云港康瑞汽车销售服务有限公司",
            "dCode": "S732073"
        }]
    }, {
        "cId": 246,
        "cName": "启东",
        "Dealers": [{
            "dName": "启东常众文峰汽车销售服务有限公司",
            "dCode": "S732077"
        }]
    }, {
        "cId": 247,
        "cName": "如东",
        "Dealers": [{
            "dName": "如东德众汽车销售服务有限公司",
            "dCode": "S732081"
        }]
    }, {
        "cId": 248,
        "cName": "海安",
        "Dealers": [{
            "dName": "海安德品汽车有限公司",
            "dCode": "S732086"
        }]
    }, {
        "cId": 249,
        "cName": "泰兴",
        "Dealers": [{
            "dName": "泰州金翱汽车销售服务有限公司",
            "dCode": "S732075"
        }]
    }, {
        "cId": 250,
        "cName": "靖江",
        "Dealers": [{
            "dName": "泰州金坤汽车销售服务有限公司",
            "dCode": "S732076"
        }]
    }, {
        "cId": 251,
        "cName": "东台",
        "Dealers": [{
            "dName": "东台宝达汽车销售服务有限公司",
            "dCode": "S232012"
        }]
    }, {
        "cId": 252,
        "cName": "灌云",
        "Dealers": [{
            "dName": "连云港康瀛汽车销售有限公司",
            "dCode": "S232008"
        }]
    }, {
        "cId": 253,
        "cName": "赣榆县",
        "Dealers": [{
            "dName": "连云港康泽汽车销售有限公司",
            "dCode": "S232011"
        }]
    }, {
        "cId": 254,
        "cName": "射阳",
        "Dealers": [{
            "dName": "射阳宝达汽车销售服务有限公司",
            "dCode": "S232016"
        }]
    }, {
        "cId": 255,
        "cName": "东海",
        "Dealers": [{
            "dName": "连云港康锦汽车销售有限公司",
            "dCode": "S232010"
        }]
    }, {
        "cId": 256,
        "cName": "兴化",
        "Dealers": [{
            "dName": "泰州金浦汽车销售服务有限公司",
            "dCode": "S232004"
        }]
    }]
}, {
    "pId": 14,
    "pName": "浙江",
    "Cities": [{
        "cId": 257,
        "cName": "杭州",
        "Dealers": [{
            "dName": "杭州百年汽车销售服务有限公司",
            "dCode": "S733039"
        }, {
            "dName": "杭州百瑞汽车有限公司",
            "dCode": "S733048"
        }, {
            "dName": "杭州元通宝通汽车有限公司",
            "dCode": "S733076"
        }, {
            "dName": "浙江一汽汽车销售服务有限公司",
            "dCode": "S733003"
        }, {
            "dName": "浙江元通宝通汽车有限公司",
            "dCode": "S733077"
        }, {
            "dName": "浙江省直汽车销售服务有限公司",
            "dCode": "S733034"
        }, {
            "dName": "浙江百腾汽车有限公司",
            "dCode": "S733071"
        }]
    }, {
        "cId": 258,
        "cName": "桐乡",
        "Dealers": [{
            "dName": "桐乡博众汽车销售有限公司",
            "dCode": "S733046"
        }]
    }, {
        "cId": 259,
        "cName": "湖州",
        "Dealers": [{
            "dName": "湖州众腾汽车销售服务有限公司",
            "dCode": "S733044"
        }, {
            "dName": "湖州长运汽车销售服务有限公司",
            "dCode": "S733031"
        }]
    }, {
        "cId": 260,
        "cName": "海宁",
        "Dealers": [{
            "dName": "海宁市群英汽车销售服务有限公司",
            "dCode": "S733049"
        }]
    }, {
        "cId": 261,
        "cName": "临安",
        "Dealers": [{
            "dName": "临安元通宝通汽车有限公司",
            "dCode": "S733061"
        }]
    }, {
        "cId": 262,
        "cName": "嘉兴",
        "Dealers": [{
            "dName": "嘉兴市北方汽车贸易有限公司",
            "dCode": "S733008"
        }]
    }, {
        "cId": 263,
        "cName": "长兴",
        "Dealers": [{
            "dName": "长兴元通汽车有限公司",
            "dCode": "S733068"
        }]
    }, {
        "cId": 264,
        "cName": "嘉善",
        "Dealers": [{
            "dName": "嘉善源通汽车销售服务有限公司",
            "dCode": "S733074"
        }]
    }, {
        "cId": 265,
        "cName": "富阳",
        "Dealers": [{
            "dName": "富阳市腾远汽车有限公司",
            "dCode": "S733078"
        }]
    }, {
        "cId": 266,
        "cName": "桐庐",
        "Dealers": [{
            "dName": "桐庐元通汽车有限公司",
            "dCode": "S233001"
        }]
    }, {
        "cId": 267,
        "cName": "建德",
        "Dealers": [{
            "dName": "杭州康桥新之众汽车有限公司",
            "dCode": "S233006"
        }]
    }, {
        "cId": 268,
        "cName": "诸暨",
        "Dealers": [{
            "dName": "诸暨元通汽车有限公司",
            "dCode": "S733075"
        }]
    }, {
        "cId": 269,
        "cName": "绍兴",
        "Dealers": [{
            "dName": "绍兴市汇丰汽车销售服务有限公司",
            "dCode": "S733041"
        }, {
            "dName": "绍兴清风汽车销售服务有限公司",
            "dCode": "S733028"
        }]
    }, {
        "cId": 270,
        "cName": "上虞",
        "Dealers": [{
            "dName": "上虞清风汽车销售服务有限公司",
            "dCode": "S733045"
        }]
    }, {
        "cId": 271,
        "cName": "衢州",
        "Dealers": [{
            "dName": "衢州祥龙汽车有限公司",
            "dCode": "S733043"
        }]
    }, {
        "cId": 272,
        "cName": "金华",
        "Dealers": [{
            "dName": "金华宝通汽车有限公司",
            "dCode": "S733057"
        }, {
            "dName": "金华金奥汽车销售服务有限公司",
            "dCode": "S933007"
        }]
    }, {
        "cId": 273,
        "cName": "东阳",
        "Dealers": [{
            "dName": "东阳市众富汽车销售服务有限公司",
            "dCode": "S733053"
        }]
    }, {
        "cId": 274,
        "cName": "永康",
        "Dealers": [{
            "dName": "永康市华奥汽车销售服务有限公司",
            "dCode": "S733054"
        }]
    }, {
        "cId": 275,
        "cName": "义乌",
        "Dealers": [{
            "dName": "义乌市恒通汽车销售服务有限公司",
            "dCode": "S733019"
        }]
    }, {
        "cId": 276,
        "cName": "嵊州",
        "Dealers": [{
            "dName": "嵊州市龙骏汽车销售服务有限公司",
            "dCode": "S733062"
        }]
    }, {
        "cId": 277,
        "cName": "新昌",
        "Dealers": [{
            "dName": "新昌县越达汽车有限公司",
            "dCode": "S233002"
        }]
    }, {
        "cId": 278,
        "cName": "江山",
        "Dealers": [{
            "dName": "江山祥宇汽车有限公司",
            "dCode": "S233003"
        }]
    }, {
        "cId": 279,
        "cName": "舟山",
        "Dealers": [{
            "dName": "舟山市霁锐汽车销售服务有限公司",
            "dCode": "S733050"
        }]
    }, {
        "cId": 280,
        "cName": "象山",
        "Dealers": [{
            "dName": "象山华恒汽车销售服务有限公司",
            "dCode": "S733056"
        }]
    }, {
        "cId": 281,
        "cName": "宁波",
        "Dealers": [{
            "dName": "宁波明众汽车销售服务有限公司",
            "dCode": "S733059"
        }, {
            "dName": "宁波联合汽车销售服务有限公司",
            "dCode": "S733011"
        }, {
            "dName": "宁波元通宝通汽车有限公司",
            "dCode": "S733079"
        }, {
            "dName": "宁波市康发汽车销售服务有限公司",
            "dCode": "S733042"
        }, {
            "dName": "宁波中基甬耀汽车销售服务有限公司",
            "dCode": "S733047"
        }, {
            "dName": "宁波轿辰康嘉汽车销售服务有限公司",
            "dCode": "S733065"
        }]
    }, {
        "cId": 282,
        "cName": "慈溪",
        "Dealers": [{
            "dName": "慈溪市华泰汽车服务有限公司",
            "dCode": "S733037"
        }, {
            "dName": "慈溪市锦星汽车销售服务有限公司",
            "dCode": "S733064"
        }]
    }, {
        "cId": 283,
        "cName": "余姚",
        "Dealers": [{
            "dName": "余姚宇顺汽车销售服务有限公司",
            "dCode": "S733038"
        }]
    }, {
        "cId": 284,
        "cName": "奉化",
        "Dealers": [{
            "dName": "奉化轿辰康发汽车销售服务有限公司",
            "dCode": "S733067"
        }]
    }, {
        "cId": 285,
        "cName": "温州",
        "Dealers": [{
            "dName": "温州市宝捷汽车销售有限公司",
            "dCode": "S733024"
        }, {
            "dName": "苍南轿辰康发汽车销售服务有限公司",
            "dCode": "S733058"
        }, {
            "dName": "温州市瓯海荣新汽车修配有限公司",
            "dCode": "S733010"
        }, {
            "dName": "温州华科欧龙汽车销售服务有限公司",
            "dCode": "S733018"
        }, {
            "dName": "温州欧龙汽车有限公司",
            "dCode": "S733069"
        }]
    }, {
        "cId": 286,
        "cName": "温岭",
        "Dealers": [{
            "dName": "温岭市金桥汽车销售服务有限公司",
            "dCode": "S733036"
        }]
    }, {
        "cId": 287,
        "cName": "台州",
        "Dealers": [{
            "dName": "台州市汇腾汽车销售服务有限公司",
            "dCode": "S733052"
        }, {
            "dName": "台州轿辰康发汽车销售服务有限公司",
            "dCode": "S733055"
        }, {
            "dName": "台州金桥汽车销售服务有限公司",
            "dCode": "S733040"
        }]
    }, {
        "cId": 288,
        "cName": "瑞安",
        "Dealers": [{
            "dName": "瑞安市国荣汽车维修服务有限公司",
            "dCode": "S733014"
        }]
    }, {
        "cId": 289,
        "cName": "丽水",
        "Dealers": [{
            "dName": "丽水市恒昌汽车有限公司",
            "dCode": "S733027"
        }, {
            "dName": "丽水市瓯迪汽车销售服务有限公司",
            "dCode": "S733063"
        }]
    }, {
        "cId": 290,
        "cName": "永嘉县",
        "Dealers": [{
            "dName": "温州国瑞汽车销售服务有限公司",
            "dCode": "S733060"
        }]
    }, {
        "cId": 291,
        "cName": "天台",
        "Dealers": [{
            "dName": "台州康桥众致汽车有限公司",
            "dCode": "S233004"
        }]
    }]
}, {
    "pId": 15,
    "pName": "安徽",
    "Cities": [{
        "cId": 292,
        "cName": "合肥",
        "Dealers": [{
            "dName": "合肥欧亚汽车服务有限公司",
            "dCode": "S734016"
        }, {
            "dName": "安徽孚迪汽车销售有限公司",
            "dCode": "S734009"
        }, {
            "dName": "安徽众力汽车销售服务有限公司",
            "dCode": "S734014"
        }, {
            "dName": "安徽宝捷汽车销售服务有限公司",
            "dCode": "S734011"
        }]
    }, {
        "cId": 293,
        "cName": "宣城",
        "Dealers": [{
            "dName": "宣城亚宝汽车销售服务有限公司",
            "dCode": "S734019"
        }]
    }, {
        "cId": 294,
        "cName": "巢湖",
        "Dealers": [{
            "dName": "巢湖亚宝汽车销售服务有限公司",
            "dCode": "S734020"
        }]
    }, {
        "cId": 295,
        "cName": "马鞍山",
        "Dealers": [{
            "dName": "马鞍山协众汽车销售有限公司",
            "dCode": "S734023"
        }]
    }, {
        "cId": 296,
        "cName": "铜陵",
        "Dealers": [{
            "dName": "铜陵市海达汽车销售服务有限公司",
            "dCode": "S734024"
        }]
    }, {
        "cId": 297,
        "cName": "安庆",
        "Dealers": [{
            "dName": "安庆环众汽车销售服务有限公司",
            "dCode": "S734030"
        }]
    }, {
        "cId": 298,
        "cName": "芜湖",
        "Dealers": [{
            "dName": "芜湖亚夏汽车股份有限公司",
            "dCode": "S734012"
        }]
    }, {
        "cId": 299,
        "cName": "黄山",
        "Dealers": [{
            "dName": "黄山亚众汽车销售服务有限公司",
            "dCode": "S734026"
        }]
    }, {
        "cId": 300,
        "cName": "池州",
        "Dealers": [{
            "dName": "池州协众汽车销售服务有限公司",
            "dCode": "S734028"
        }]
    }, {
        "cId": 301,
        "cName": "宁国",
        "Dealers": [{
            "dName": "宁国亚宝汽车销售服务有限公司",
            "dCode": "S234001"
        }]
    }, {
        "cId": 302,
        "cName": "阜阳",
        "Dealers": [{
            "dName": "阜阳市永鑫汽车销售服务有限公司",
            "dCode": "S734013"
        }]
    }, {
        "cId": 303,
        "cName": "滁州",
        "Dealers": [{
            "dName": "滁州金通联众汽车销售有限公司",
            "dCode": "S734015"
        }]
    }, {
        "cId": 304,
        "cName": "亳州",
        "Dealers": [{
            "dName": "亳州中源汽车销售服务有限公司",
            "dCode": "S734021"
        }]
    }, {
        "cId": 305,
        "cName": "宿州",
        "Dealers": [{
            "dName": "宿州市丽豪汽车销售服务有限公司",
            "dCode": "S734018"
        }]
    }, {
        "cId": 306,
        "cName": "六安",
        "Dealers": [{
            "dName": "六安和众汽车销售服务有限公司",
            "dCode": "S734022"
        }]
    }, {
        "cId": 307,
        "cName": "蚌埠",
        "Dealers": [{
            "dName": "蚌埠市华诚轿车销售服务有限公司",
            "dCode": "S734017"
        }]
    }, {
        "cId": 308,
        "cName": "淮北",
        "Dealers": [{
            "dName": "淮北市运昌汽车销售服务有限责任公司",
            "dCode": "S734025"
        }]
    }, {
        "cId": 309,
        "cName": "淮南",
        "Dealers": [{
            "dName": "淮南盛之杰汽车销售服务有限公司",
            "dCode": "S734027"
        }]
    }]
}, {
    "pId": 16,
    "pName": "广东",
    "Cities": [{
        "cId": 310,
        "cName": "韶关",
        "Dealers": [{
            "dName": "韶关市亿华汽车贸易有限公司",
            "dCode": "S744045"
        }]
    }, {
        "cId": 311,
        "cName": "广州",
        "Dealers": [{
            "dName": "广州市健稳汽车贸易有限公司",
            "dCode": "S744048"
        }, {
            "dName": "广州市大吉汽车销售服务有限公司",
            "dCode": "S744049"
        }, {
            "dName": "广东物通溢众汽车展销中心有限公司",
            "dCode": "S744047"
        }, {
            "dName": "广州市南菱万众汽车维修服务有限公司",
            "dCode": "S744056"
        }, {
            "dName": "广州市梅花园汽车销售服务有限公司",
            "dCode": "S744015"
        }, {
            "dName": "广州市锦众汽车贸易有限公司",
            "dCode": "S744019"
        }, {
            "dName": "广东物通凯骏汽车有限公司",
            "dCode": "S744046"
        }, {
            "dName": "广东君乐汽车贸易有限公司",
            "dCode": "S944002"
        }, {
            "dName": "广州市安捷鑫众汽车有限公司",
            "dCode": "S744077"
        }, {
            "dName": "广州庞大一众汽车销售服务有限公司",
            "dCode": "S744068"
        }]
    }, {
        "cId": 312,
        "cName": "清远",
        "Dealers": [{
            "dName": "清远南方合众汽车销售服务有限公司",
            "dCode": "S744052"
        }]
    }, {
        "cId": 313,
        "cName": "东莞",
        "Dealers": [{
            "dName": "东莞市鸿众汽车销售服务有限公司",
            "dCode": "S744057"
        }, {
            "dName": "东莞市锦众汽车贸易有限公司",
            "dCode": "S744060"
        }, {
            "dName": "东莞市捷达通贸易有限公司",
            "dCode": "S744011"
        }, {
            "dName": "东莞市新大地汽车贸易有限公司",
            "dCode": "S744012"
        }, {
            "dName": "东莞市昌发汽车贸易有限公司",
            "dCode": "S744035"
        }, {
            "dName": "东莞市东深奇建汽车销售服务有限公司",
            "dCode": "S744066"
        }]
    }, {
        "cId": 314,
        "cName": "长安镇",
        "Dealers": [{
            "dName": "东莞庞大一众汽车销售服务有限公司",
            "dCode": "S744069"
        }]
    }, {
        "cId": 315,
        "cName": "深圳",
        "Dealers": [{
            "dName": "深圳市南方腾龙汽车销售服务有限公司",
            "dCode": "S744051"
        }, {
            "dName": "深圳市北奇建贸易有限公司",
            "dCode": "S744063"
        }, {
            "dName": "深圳市安进汽车贸易有限公司",
            "dCode": "S744021"
        }, {
            "dName": "深圳市昊天林实业有限公司",
            "dCode": "S744023"
        }, {
            "dName": "深圳市奇建贸易有限公司",
            "dCode": "S944012"
        }, {
            "dName": "深圳市清水河奇建贸易有限公司",
            "dCode": "S744064"
        }, {
            "dName": "深圳市昊天林安琪汽车有限公司",
            "dCode": "S744075"
        }]
    }, {
        "cId": 316,
        "cName": "揭阳",
        "Dealers": [{
            "dName": "揭阳合和汽车销售服务有限公司",
            "dCode": "S744059"
        }]
    }, {
        "cId": 317,
        "cName": "河源",
        "Dealers": [{
            "dName": "河源市德宝汽车贸易有限公司",
            "dCode": "S744054"
        }]
    }, {
        "cId": 318,
        "cName": "梅州",
        "Dealers": [{
            "dName": "梅州市新宇汽车销售服务有限公司",
            "dCode": "S744055"
        }]
    }, {
        "cId": 319,
        "cName": "惠州",
        "Dealers": [{
            "dName": "惠州市志通恒泰汽车销售服务有限公司",
            "dCode": "S744062"
        }, {
            "dName": "惠州市大众汽车销售服务有限公司",
            "dCode": "S744014"
        }]
    }, {
        "cId": 320,
        "cName": "潮州",
        "Dealers": [{
            "dName": "潮州市通达汽车贸易有限公司",
            "dCode": "S744018"
        }]
    }, {
        "cId": 321,
        "cName": "汕头",
        "Dealers": [{
            "dName": "汕头市裕丰交通经济发展有限公司",
            "dCode": "S744024"
        }, {
            "dName": "汕头市庞大一众汽车销售服务有限公司",
            "dCode": "S744072"
        }]
    }, {
        "cId": 322,
        "cName": "汕尾",
        "Dealers": [{
            "dName": "汕尾市君乐汽车销售服务有限公司",
            "dCode": "S244001"
        }]
    }, {
        "cId": 323,
        "cName": "佛山",
        "Dealers": [{
            "dName": "佛山市英丰汽车销售服务有限公司",
            "dCode": "S744058"
        }, {
            "dName": "佛山市瀚众汽车贸易服务有限公司",
            "dCode": "S744067"
        }, {
            "dName": "佛山市合诚汽车销售服务有限公司",
            "dCode": "S744031"
        }, {
            "dName": "佛山市南海区拓华汽车贸易有限公司",
            "dCode": "S744039"
        }, {
            "dName": "佛山市广物君乐汽车销售服务有限公司",
            "dCode": "S744074"
        }]
    }, {
        "cId": 324,
        "cName": "肇庆",
        "Dealers": [{
            "dName": "肇庆市安迅汽车有限公司",
            "dCode": "S744061"
        }]
    }, {
        "cId": 325,
        "cName": "湛江",
        "Dealers": [{
            "dName": "湛江市正日汽车贸易有限公司",
            "dCode": "S744042"
        }]
    }, {
        "cId": 326,
        "cName": "中山",
        "Dealers": [{
            "dName": "中山市众腾汽车有限公司",
            "dCode": "S744053"
        }, {
            "dName": "中山市创世纪汽车有限公司",
            "dCode": "S744006"
        }, {
            "dName": "中山庞大一众汽车销售服务有限公司",
            "dCode": "S744076"
        }]
    }, {
        "cId": 327,
        "cName": "阳江",
        "Dealers": [{
            "dName": "阳江安捷源众汽车销售服务有限公司",
            "dCode": "S744065"
        }]
    }, {
        "cId": 328,
        "cName": "江门",
        "Dealers": [{
            "dName": "江门市新众汽车销售服务有限公司",
            "dCode": "S744040"
        }, {
            "dName": "江门市钜荣汽车销售服务有限公司",
            "dCode": "S744070"
        }]
    }, {
        "cId": 329,
        "cName": "茂名",
        "Dealers": [{
            "dName": "茂名市茂南茂汉汽车贸易有限公司",
            "dCode": "S744043"
        }]
    }, {
        "cId": 330,
        "cName": "顺德",
        "Dealers": [{
            "dName": "佛山市顺德区世锦汽车贸易有限公司",
            "dCode": "S744050"
        }]
    }, {
        "cId": 331,
        "cName": "珠海",
        "Dealers": [{
            "dName": "珠海市香洲一汽汽车销售有限公司",
            "dCode": "S944011"
        }, {
            "dName": "珠海市珠光汽车有限公司",
            "dCode": "S944017"
        }]
    }]
}, {
    "pId": 17,
    "pName": "福建",
    "Cities": [{
        "cId": 332,
        "cName": "三明",
        "Dealers": [{
            "dName": "三明盈众汽车有限公司",
            "dCode": "S735021"
        }]
    }, {
        "cId": 333,
        "cName": "福州",
        "Dealers": [{
            "dName": "福州盈众汽车有限公司",
            "dCode": "S735023"
        }, {
            "dName": "福州致远汽车销售服务有限公司",
            "dCode": "S735027"
        }, {
            "dName": "福州永力通汽车贸易有限公司",
            "dCode": "S735011"
        }, {
            "dName": "福建省福京汽车贸易有限公司",
            "dCode": "S935001"
        }]
    }, {
        "cId": 334,
        "cName": "南平",
        "Dealers": [{
            "dName": "南平盈众汽车有限公司",
            "dCode": "S735024"
        }]
    }, {
        "cId": 335,
        "cName": "宁德",
        "Dealers": [{
            "dName": "宁德盈众汽车有限公司",
            "dCode": "S735025"
        }]
    }, {
        "cId": 336,
        "cName": "闽侯",
        "Dealers": [{
            "dName": "福建永通达汽车贸易有限公司",
            "dCode": "S735029"
        }]
    }, {
        "cId": 337,
        "cName": "莆田",
        "Dealers": [{
            "dName": "莆田市奇奇贸易发展有限公司",
            "dCode": "S735012"
        }]
    }, {
        "cId": 338,
        "cName": "厦门",
        "Dealers": [{
            "dName": "厦门致远汽车有限公司",
            "dCode": "S735022"
        }, {
            "dName": "厦门君达汽车有限公司",
            "dCode": "S735026"
        }, {
            "dName": "厦门明至汽车有限公司",
            "dCode": "S735032"
        }, {
            "dName": "厦门市盈众汽车销售有限公司",
            "dCode": "S735007"
        }]
    }, {
        "cId": 339,
        "cName": "漳州",
        "Dealers": [{
            "dName": "漳州致远汽车有限公司",
            "dCode": "S735030"
        }, {
            "dName": "漳州盈众汽车销售服务有限公司",
            "dCode": "S735020"
        }]
    }, {
        "cId": 340,
        "cName": "龙岩",
        "Dealers": [{
            "dName": "龙岩盈众汽车有限公司",
            "dCode": "S735031"
        }, {
            "dName": "龙岩市众邦汽车贸易有限公司",
            "dCode": "S735015"
        }]
    }, {
        "cId": 341,
        "cName": "晋江",
        "Dealers": [{
            "dName": "晋江市金阳汽车销售有限公司",
            "dCode": "S735017"
        }]
    }, {
        "cId": 342,
        "cName": "泉州",
        "Dealers": [{
            "dName": "泉州盈众汽车销售服务有限公司",
            "dCode": "S735019"
        }, {
            "dName": "泉州大众汽车销售服务有限公司",
            "dCode": "S935010"
        }, {
            "dName": "安溪华迪汽车销售服务有限公司",
            "dCode": "S235001"
        }]
    }, {
        "cId": 343,
        "cName": "南安",
        "Dealers": [{
            "dName": "南安盈众汽车销售服务有限公司",
            "dCode": "S735033"
        }]
    }, {
        "cId": 344,
        "cName": "惠安",
        "Dealers": [{
            "dName": "惠安盈众汽车销售服务有限公司",
            "dCode": "S235002"
        }]
    }]
}, {
    "pId": 18,
    "pName": "江西",
    "Cities": [{
        "cId": 345,
        "cName": "上饶",
        "Dealers": [{
            "dName": "上饶市欧亚汽车销售有限公司",
            "dCode": "S736012"
        }]
    }, {
        "cId": 346,
        "cName": "赣州",
        "Dealers": [{
            "dName": "赣州金涛汽车销售服务有限公司",
            "dCode": "S736013"
        }, {
            "dName": "赣州欧亚汽车销售有限公司",
            "dCode": "S736016"
        }]
    }, {
        "cId": 347,
        "cName": "吉安",
        "Dealers": [{
            "dName": "吉安欧亚汽车销售有限公司",
            "dCode": "S736014"
        }]
    }, {
        "cId": 348,
        "cName": "南昌",
        "Dealers": [{
            "dName": "南昌欧亚汽车销售有限公司",
            "dCode": "S736005"
        }, {
            "dName": "江西华宏名众汽车有限公司",
            "dCode": "S736017"
        }, {
            "dName": "江西协众汽车发展有限公司",
            "dCode": "S936005"
        }, {
            "dName": "南昌恒信一路汽车销售服务有限公司",
            "dCode": "S736024"
        }]
    }, {
        "cId": 349,
        "cName": "九江",
        "Dealers": [{
            "dName": "九江宏达汽车贸易有限公司",
            "dCode": "S736007"
        }, {
            "dName": "九江九源汽车销售服务有限公司",
            "dCode": "S736020"
        }]
    }, {
        "cId": 350,
        "cName": "宜春",
        "Dealers": [{
            "dName": "江西佳辉汽车贸易服务有限公司",
            "dCode": "S736008"
        }]
    }, {
        "cId": 351,
        "cName": "萍乡",
        "Dealers": [{
            "dName": "萍乡市永安昌荣实业有限公司",
            "dCode": "S736022"
        }]
    }, {
        "cId": 352,
        "cName": "浮梁",
        "Dealers": [{
            "dName": "景德镇欧亚汽车销售有限公司",
            "dCode": "S736015"
        }]
    }, {
        "cId": 353,
        "cName": "余江",
        "Dealers": [{
            "dName": "鹰潭华宏汽车有限公司",
            "dCode": "S736021"
        }]
    }]
}, {
    "pId": 19,
    "pName": "湖南",
    "Cities": [{
        "cId": 354,
        "cName": "永州",
        "Dealers": [{
            "dName": "湖南省永州市永恒汽车贸易有限公司",
            "dCode": "S743015"
        }]
    }, {
        "cId": 355,
        "cName": "娄底",
        "Dealers": [{
            "dName": "娄底大汉汽车贸易有限公司",
            "dCode": "S743018"
        }]
    }, {
        "cId": 356,
        "cName": "长沙",
        "Dealers": [{
            "dName": "湖南中拓瑞众汽车销售服务有限公司",
            "dCode": "S743016"
        }, {
            "dName": "湖南华洋汽车贸易有限公司",
            "dCode": "S743009"
        }, {
            "dName": "湖南汽车城永通有限公司",
            "dCode": "S943001"
        }, {
            "dName": "湖南永通汽车销售服务有限公司",
            "dCode": "S743021"
        }, {
            "dName": "湖南华洋众广汽车销售服务有限公司",
            "dCode": "S743022"
        }, {
            "dName": "湖南长久博腾汽车销售服务有限公司",
            "dCode": "S743028"
        }, {
            "dName": "长沙大汉汽车贸易有限公司",
            "dCode": "S743030"
        }]
    }, {
        "cId": 357,
        "cName": "怀化",
        "Dealers": [{
            "dName": "怀化春茂汽车销售服务有限公司",
            "dCode": "S743019"
        }]
    }, {
        "cId": 358,
        "cName": "益阳",
        "Dealers": [{
            "dName": "益阳永通汽车销售服务有限公司",
            "dCode": "S743020"
        }]
    }, {
        "cId": 359,
        "cName": "湘潭",
        "Dealers": [{
            "dName": "湘潭东富汽车销售服务有限公司",
            "dCode": "S942033"
        }, {
            "dName": "湘潭市健车行汽车服务有限公司",
            "dCode": "S843001"
        }]
    }, {
        "cId": 360,
        "cName": "郴州",
        "Dealers": [{
            "dName": "郴州永通汽车销售服务有限公司",
            "dCode": "S743023"
        }]
    }, {
        "cId": 361,
        "cName": "株洲",
        "Dealers": [{
            "dName": "株洲蓝马汽车销售服务有限公司",
            "dCode": "S743008"
        }, {
            "dName": "株洲市健车行汽车服务有限公司",
            "dCode": "S743024"
        }]
    }, {
        "cId": 362,
        "cName": "常德",
        "Dealers": [{
            "dName": "常德裕安贸易有限公司",
            "dCode": "S743010"
        }]
    }, {
        "cId": 363,
        "cName": "衡阳",
        "Dealers": [{
            "dName": "衡阳市西城汽车经贸有限公司",
            "dCode": "S743011"
        }, {
            "dName": "衡阳长久博华汽车销售服务有限公司",
            "dCode": "S743029"
        }]
    }, {
        "cId": 364,
        "cName": "邵阳",
        "Dealers": [{
            "dName": "邵阳市宝庆汽车超市有限公司",
            "dCode": "S743013"
        }]
    }, {
        "cId": 365,
        "cName": "岳阳",
        "Dealers": [{
            "dName": "湖南邦田汽车服务有限公司",
            "dCode": "S743014"
        }, {
            "dName": "岳阳大汉汽贸有限公司",
            "dCode": "S743031"
        }]
    }, {
        "cId": 366,
        "cName": "浏阳",
        "Dealers": [{
            "dName": "浏阳永通汽车销售服务有限公司",
            "dCode": "S743026"
        }]
    }, {
        "cId": 367,
        "cName": "吉首",
        "Dealers": [{
            "dName": "湘西永通汽车销售服务有限公司",
            "dCode": "S743025"
        }]
    }, {
        "cId": 368,
        "cName": "张家界",
        "Dealers": [{
            "dName": "张家界永通汽车销售服务有限公司",
            "dCode": "S243001"
        }]
    }, {
        "cId": 369,
        "cName": "平江",
        "Dealers": [{
            "dName": "平江县邦田汽车服务有限公司",
            "dCode": "S243002"
        }]
    }, {
        "cId": 370,
        "cName": "湘乡",
        "Dealers": [{
            "dName": "湘乡湘健汽车服务有限公司",
            "dCode": "S243003"
        }]
    }]
}, {
    "pId": 20,
    "pName": "广西",
    "Cities": [{
        "cId": 371,
        "cName": "桂林",
        "Dealers": [{
            "dName": "桂林鑫广达汽车销售服务有限责任公司",
            "dCode": "S745014"
        }]
    }, {
        "cId": 373,
        "cName": "玉林",
        "Dealers": [{
            "dName": "玉林市弘标汽车销售服务有限公司",
            "dCode": "S745016"
        }]
    }, {
        "cId": 374,
        "cName": "贵港",
        "Dealers": [{
            "dName": "贵港市弘捷汽车销售服务有限公司",
            "dCode": "S745019"
        }]
    }, {
        "cId": 375,
        "cName": "河池",
        "Dealers": [{
            "dName": "河池市弘捷汽车销售服务有限公司",
            "dCode": "S745018"
        }]
    }, {
        "cId": 376,
        "cName": "柳州",
        "Dealers": [{
            "dName": "柳州市盛铭汽车贸易有限公司",
            "dCode": "S745002"
        }, {
            "dName": "柳州鑫广达博腾汽车销售服务有限公司",
            "dCode": "S745020"
        }]
    }, {
        "cId": 377,
        "cName": "南宁",
        "Dealers": [{
            "dName": "广西鑫广达长久汽车商贸有限公司",
            "dCode": "S745015"
        }, {
            "dName": "广西弘捷汽车销售服务有限公司",
            "dCode": "S945001"
        }, {
            "dName": "广西鑫广达博冠汽车销售服务有限公司",
            "dCode": "S745021"
        }]
    }]
}, {
    "pId": 21,
    "pName": "海南",
    "Cities": [{
        "cId": 372,
        "cName": "海口",
        "Dealers": [{
            "dName": "海南博世汽车服务有限公司",
            "dCode": "S746004"
        }, {
            "dName": "海南博众汽车销售有限公司",
            "dCode": "S746005"
        }]
    }]
}, {
    "pId": 22,
    "pName": "四川",
    "Cities": [{
        "cId": 378,
        "cName": "成都",
        "Dealers": [{
            "dName": "东创建国汽车集团成都天弘车业有限公司",
            "dCode": "S751025"
        }, {
            "dName": "四川申蓉和浩汽车销售服务有限公司",
            "dCode": "S751026"
        }, {
            "dName": "成都启阳远航汽车销售服务有限公司",
            "dCode": "S751034"
        }, {
            "dName": "成都宏羽众信汽车销售服务有限公司",
            "dCode": "S751036"
        }, {
            "dName": "成都运通博恩汽车销售有限公司",
            "dCode": "S751033"
        }, {
            "dName": "四川长征汽车贸易有限公司",
            "dCode": "S751006"
        }, {
            "dName": "成都市强生实业有限责任公司",
            "dCode": "S751010"
        }, {
            "dName": "四川华星大众汽车销售服务有限公司",
            "dCode": "S751016"
        }, {
            "dName": "成都启新汽车服务有限责任公司",
            "dCode": "S751021"
        }, {
            "dName": "四川精典吉众汽车销售服务有限公司",
            "dCode": "S751022"
        }, {
            "dName": "四川一汽贸易有限责任公司",
            "dCode": "S951001"
        }, {
            "dName": "成都曙光汽车销售服务有限公司",
            "dCode": "S951005"
        }, {
            "dName": "崇州瑞龙汽车销售服务有限公司",
            "dCode": "S751037"
        }, {
            "dName": "成都汇和汽车销售有限公司",
            "dCode": "S751040"
        }, {
            "dName": "四川申蓉雅泰汽车销售服务有限公司",
            "dCode": "S751042"
        }, {
            "dName": "成都浩龙汽车销售服务有限公司",
            "dCode": "S751041"
        }, {
            "dName": "成都市泰鸿宇汽车贸易有限责任公司",
            "dCode": "S751044"
        }]
    }, {
        "cId": 379,
        "cName": "都江堰",
        "Dealers": [{
            "dName": "都江堰阔龙汽车销售服务有限公司",
            "dCode": "S751043"
        }]
    }, {
        "cId": 380,
        "cName": "郫县",
        "Dealers": [{
            "dName": "四川金信华远汽车销售有限公司",
            "dCode": "S751047"
        }]
    }, {
        "cId": 381,
        "cName": "蒲江",
        "Dealers": [{
            "dName": "成都汇腾汽车销售服务有限公司",
            "dCode": "S251003"
        }]
    }, {
        "cId": 382,
        "cName": "金堂",
        "Dealers": [{
            "dName": "成都广汇申蓉汇通汽车销售服务有限公司",
            "dCode": "S251004"
        }]
    }, {
        "cId": 383,
        "cName": "眉山",
        "Dealers": [{
            "dName": "四川省眉山市建国汽车有限公司",
            "dCode": "S751024"
        }]
    }, {
        "cId": 384,
        "cName": "乐山",
        "Dealers": [{
            "dName": "乐山市华茂车业有限责任公司",
            "dCode": "S751018"
        }]
    }, {
        "cId": 385,
        "cName": "自贡",
        "Dealers": [{
            "dName": "自贡市和众汽车销售服务有限公司",
            "dCode": "S751027"
        }]
    }, {
        "cId": 386,
        "cName": "泸州",
        "Dealers": [{
            "dName": "泸州松明汽贸有限公司",
            "dCode": "S751019"
        }]
    }, {
        "cId": 387,
        "cName": "攀枝花",
        "Dealers": [{
            "dName": "攀枝花市力行工贸有限责任公司",
            "dCode": "S951012"
        }]
    }, {
        "cId": 388,
        "cName": "内江",
        "Dealers": [{
            "dName": "内江瑞龙汽车销售服务有限公司",
            "dCode": "S751038"
        }]
    }, {
        "cId": 389,
        "cName": "仁寿",
        "Dealers": [{
            "dName": "四川仁寿恒信汽车销售有限公司",
            "dCode": "S251001"
        }]
    }, {
        "cId": 390,
        "cName": "德阳",
        "Dealers": [{
            "dName": "德阳万路众悦汽车销售服务有限公司",
            "dCode": "S751028"
        }, {
            "dName": "德阳盛鸿汽车销售服务有限公司",
            "dCode": "S751030"
        }, {
            "dName": "四川德阳川西汽车销售服务有限公司",
            "dCode": "S751017"
        }]
    }, {
        "cId": 391,
        "cName": "达州",
        "Dealers": [{
            "dName": "达州市新世纪汽车销售服务有限公司",
            "dCode": "S751029"
        }]
    }, {
        "cId": 392,
        "cName": "广元",
        "Dealers": [{
            "dName": "广元建雄汽车销售服务有限公司",
            "dCode": "S751031"
        }]
    }, {
        "cId": 393,
        "cName": "绵阳",
        "Dealers": [{
            "dName": "绵阳景鸿汽车销售服务有限公司",
            "dCode": "S751032"
        }, {
            "dName": "绵阳市倍尔轿车服务有限公司",
            "dCode": "S751007"
        }]
    }, {
        "cId": 394,
        "cName": "遂宁",
        "Dealers": [{
            "dName": "遂宁市瑞胜汽车销售有限公司",
            "dCode": "S751035"
        }]
    }, {
        "cId": 395,
        "cName": "南充",
        "Dealers": [{
            "dName": "南充明云惠民车业有限公司",
            "dCode": "S751039"
        }, {
            "dName": "南充明云运行车业有限公司",
            "dCode": "S751045"
        }]
    }, {
        "cId": 396,
        "cName": "资阳",
        "Dealers": [{
            "dName": "资阳清巍茂源汽车销售服务有限公司",
            "dCode": "S751046"
        }]
    }, {
        "cId": 397,
        "cName": "广汉",
        "Dealers": [{
            "dName": "四川广汉恒达汽车销售有限公司",
            "dCode": "S251002"
        }]
    }]
}, {
    "pId": 23,
    "pName": "陕西",
    "Cities": [{
        "cId": 398,
        "cName": "西安",
        "Dealers": [{
            "dName": "陕西东明汽车商行有限公司",
            "dCode": "S761013"
        }, {
            "dName": "陕西天一汽车销售服务有限责任公司",
            "dCode": "S761014"
        }, {
            "dName": "西安新白云汽车销售服务有限公司",
            "dCode": "S761020"
        }, {
            "dName": "陕西百佳汽车贸易有限公司",
            "dCode": "S761003"
        }, {
            "dName": "西安秦川唐都机电汽车配件销售有限公司",
            "dCode": "S761007"
        }, {
            "dName": "陕西鹰之杰汽车贸易有限公司",
            "dCode": "S761009"
        }, {
            "dName": "陕西尊荣致诚汽车贸易有限公司",
            "dCode": "S761024"
        }]
    }, {
        "cId": 399,
        "cName": "榆林",
        "Dealers": [{
            "dName": "榆林市恒源汽贸有限公司",
            "dCode": "S761015"
        }, {
            "dName": "榆林市恒丰汽贸有限公司",
            "dCode": "S761005"
        }]
    }, {
        "cId": 400,
        "cName": "安康",
        "Dealers": [{
            "dName": "安康市庞大一众汽车销售有限公司",
            "dCode": "S761017"
        }]
    }, {
        "cId": 401,
        "cName": "宝鸡",
        "Dealers": [{
            "dName": "宝鸡市宝众汽车销售服务有限公司",
            "dCode": "S761016"
        }]
    }, {
        "cId": 402,
        "cName": "汉中",
        "Dealers": [{
            "dName": "汉中博通汽车销售服务有限公司",
            "dCode": "S761019"
        }]
    }, {
        "cId": 403,
        "cName": "咸阳",
        "Dealers": [{
            "dName": "咸阳恒丰汽贸有限公司",
            "dCode": "S761021"
        }]
    }, {
        "cId": 404,
        "cName": "延安",
        "Dealers": [{
            "dName": "延安市宝塔区黄泰有限责任公司",
            "dCode": "S761010"
        }]
    }, {
        "cId": 405,
        "cName": "神木",
        "Dealers": [{
            "dName": "神木县恒捷汽贸有限公司",
            "dCode": "S761022"
        }]
    }, {
        "cId": 406,
        "cName": "渭南",
        "Dealers": [{
            "dName": "渭南佳燕汽车贸易有限公司",
            "dCode": "S761018"
        }]
    }, {
        "cId": 407,
        "cName": "韩城",
        "Dealers": [{
            "dName": "韩城市众瑞汽车销售有限责任公司",
            "dCode": "S261001"
        }]
    }, {
        "cId": 408,
        "cName": "靖边",
        "Dealers": [{
            "dName": "靖边县恒博汽贸有限公司",
            "dCode": "S261003"
        }]
    }, {
        "cId": 409,
        "cName": "府谷",
        "Dealers": [{
            "dName": "府谷县恒捷汽贸有限公司",
            "dCode": "S261004"
        }]
    }, {
        "cId": 410,
        "cName": "铜川",
        "Dealers": [{
            "dName": "铜川新区黄泰汽车销售服务有限责任公司",
            "dCode": "S261002"
        }]
    }]
}, {
    "pId": 24,
    "pName": "重庆",
    "Cities": [{
        "cId": 411,
        "cName": "重庆",
        "Dealers": [{
            "dName": "重庆百事达华博汽车销售服务有限公司",
            "dCode": "S755009"
        }, {
            "dName": "重庆龙华实业集团众华汽车销售服务有限公司",
            "dCode": "S755011"
        }, {
            "dName": "重庆龙华实业集团协众汽车销售服务有限公司",
            "dCode": "S755010"
        }, {
            "dName": "重庆商社汽车贸易有限公司",
            "dCode": "S755002"
        }, {
            "dName": "重庆龙华实业集团众友汽车销售服务有限公司",
            "dCode": "S755012"
        }, {
            "dName": "重庆盛驰汽车有限公司",
            "dCode": "S755013"
        }, {
            "dName": "重庆商社众志渝涵汽车销售有限公司",
            "dCode": "S255002"
        }]
    }, {
        "cId": 420,
        "cName": "涪陵",
        "Dealers": [{
            "dName": "重庆百事达华驰汽车销售服务有限公司",
            "dCode": "S255001"
        }]
    }]
}, {
    "pId": 25,
    "pName": "贵州",
    "Cities": [{
        "cId": 412,
        "cName": "遵义",
        "Dealers": [{
            "dName": "遵义市千汇汽车销售服务有限公司",
            "dCode": "S752002"
        }, {
            "dName": "遵义华来金汽车贸易有限公司",
            "dCode": "S752001"
        }]
    }, {
        "cId": 413,
        "cName": "兴义",
        "Dealers": [{
            "dName": "兴义市恒信众联汽车销售服务有限公司",
            "dCode": "S752003"
        }]
    }, {
        "cId": 414,
        "cName": "安顺",
        "Dealers": [{
            "dName": "安顺恒信众联汽车销售服务有限公司",
            "dCode": "S752005"
        }]
    }, {
        "cId": 415,
        "cName": "贵阳",
        "Dealers": [{
            "dName": "贵州利和汽车贸易有限公司",
            "dCode": "S952002"
        }, {
            "dName": "贵州汽车修理公司",
            "dCode": "S952003"
        }, {
            "dName": "贵州四扬汽车销售服务有限公司",
            "dCode": "S952007"
        }]
    }, {
        "cId": 416,
        "cName": "凯里",
        "Dealers": [{
            "dName": "凯里恒信众联汽车销售服务有限公司",
            "dCode": "S752004"
        }]
    }, {
        "cId": 417,
        "cName": "六盘水",
        "Dealers": [{
            "dName": "六盘水和通汽车销售服务有限公司",
            "dCode": "S752006"
        }]
    }, {
        "cId": 418,
        "cName": "铜仁",
        "Dealers": [{
            "dName": "铜仁恒信众联汽车销售服务有限公司",
            "dCode": "S752008"
        }]
    }, {
        "cId": 419,
        "cName": "都匀",
        "Dealers": [{
            "dName": "都匀恒信众联汽车销售服务有限公司",
            "dCode": "S752007"
        }]
    }]
}, {
    "pId": 26,
    "pName": "新疆",
    "Cities": [{
        "cId": 421,
        "cName": "乌鲁木齐",
        "Dealers": [{
            "dName": "新疆庞大一众汽车销售服务有限公司",
            "dCode": "S765009"
        }, {
            "dName": "新疆汇捷汽车销售服务有限责任公司",
            "dCode": "S765007"
        }, {
            "dName": "新疆天汇华宇汽车销售服务有限责任公司",
            "dCode": "S765008"
        }, {
            "dName": "乌鲁木齐庞大腾众汽车销售有限公司",
            "dCode": "S765016"
        }]
    }, {
        "cId": 422,
        "cName": "库尔勒",
        "Dealers": [{
            "dName": "库尔勒庞大一众汽车销售服务有限公司",
            "dCode": "S765010"
        }]
    }, {
        "cId": 423,
        "cName": "喀什",
        "Dealers": [{
            "dName": "喀什庞大一众汽车销售服务有限公司",
            "dCode": "S765011"
        }]
    }, {
        "cId": 424,
        "cName": "哈密",
        "Dealers": [{
            "dName": "哈密庞大一众汽车销售服务有限公司",
            "dCode": "S765012"
        }]
    }, {
        "cId": 425,
        "cName": "昌吉",
        "Dealers": [{
            "dName": "昌吉市庞大一众汽车销售服务有限公司",
            "dCode": "S765014"
        }]
    }, {
        "cId": 426,
        "cName": "克拉玛依",
        "Dealers": [{
            "dName": "克拉玛依庞大一众汽车销售服务有限公司",
            "dCode": "S765015"
        }]
    }, {
        "cId": 427,
        "cName": "阿克苏",
        "Dealers": [{
            "dName": "阿克苏振宇汽车销售有限责任公司",
            "dCode": "S765005"
        }]
    }, {
        "cId": 428,
        "cName": "石河子",
        "Dealers": [{
            "dName": "石河子市大得汽车销售服务有限公司",
            "dCode": "S265001"
        }]
    }]
}, {
    "pId": 27,
    "pName": "云南",
    "Cities": [{
        "cId": 429,
        "cName": "大理",
        "Dealers": [{
            "dName": "大理阿鹏有限责任公司",
            "dCode": "S753011"
        }]
    }, {
        "cId": 430,
        "cName": "昆明",
        "Dealers": [{
            "dName": "昆明谊众汽车销售有限公司",
            "dCode": "S753016"
        }, {
            "dName": "云南一汽工贸汽车销售服务有限公司",
            "dCode": "S753019"
        }, {
            "dName": "云南金鼎汽车贸易有限公司",
            "dCode": "S753021"
        }, {
            "dName": "云南云汽汽车销售服务有限公司",
            "dCode": "S753022"
        }, {
            "dName": "昆明涌鑫之众贸易有限公司",
            "dCode": "S753032"
        }]
    }, {
        "cId": 431,
        "cName": "楚雄",
        "Dealers": [{
            "dName": "楚雄易通汽车销售服务有限公司",
            "dCode": "S753029"
        }]
    }, {
        "cId": 432,
        "cName": "玉龙",
        "Dealers": [{
            "dName": "丽江恒盛通达汽车销售有限公司",
            "dCode": "S212001"
        }]
    }, {
        "cId": 433,
        "cName": "嵩明",
        "Dealers": [{
            "dName": "昆明捷通达汽车销售有限公司",
            "dCode": "S212003"
        }]
    }, {
        "cId": 434,
        "cName": "安宁",
        "Dealers": [{
            "dName": "安宁谊众汽车销售有限公司",
            "dCode": "S212004"
        }]
    }, {
        "cId": 435,
        "cName": "玉溪",
        "Dealers": [{
            "dName": "玉溪驰瑞汽车销售服务有限公司",
            "dCode": "S753023"
        }]
    }, {
        "cId": 436,
        "cName": "开远",
        "Dealers": [{
            "dName": "红河州鸿云汽车经贸有限公司",
            "dCode": "S753024"
        }]
    }, {
        "cId": 437,
        "cName": "西双版纳",
        "Dealers": [{
            "dName": "西双版纳捷成通达汽车销售有限公司",
            "dCode": "S753026"
        }]
    }, {
        "cId": 438,
        "cName": "曲靖",
        "Dealers": [{
            "dName": "曲靖宝捷汽车销售有限公司",
            "dCode": "S753027"
        }, {
            "dName": "云南曲靖云鑫工贸有限公司",
            "dCode": "S753015"
        }]
    }, {
        "cId": 439,
        "cName": "昭通",
        "Dealers": [{
            "dName": "昭通市恒升汽车服务有限公司",
            "dCode": "S753025"
        }]
    }, {
        "cId": 440,
        "cName": "保山",
        "Dealers": [{
            "dName": "保山联通汽车销售维修有限责任公司",
            "dCode": "S753013"
        }]
    }, {
        "cId": 441,
        "cName": "文山",
        "Dealers": [{
            "dName": "文山捷惠汽车销售服务有限公司",
            "dCode": "S753030"
        }]
    }, {
        "cId": 442,
        "cName": "蒙自",
        "Dealers": [{
            "dName": "红河州捷鸿汽车经贸有限公司",
            "dCode": "S753031"
        }]
    }, {
        "cId": 443,
        "cName": "临沧",
        "Dealers": [{
            "dName": "临沧市添福源汽车贸易有限公司",
            "dCode": "S753033"
        }]
    }, {
        "cId": 444,
        "cName": "普洱",
        "Dealers": [{
            "dName": "普洱捷顺通达汽车销售服务有限公司",
            "dCode": "S753028"
        }]
    }, {
        "cId": 445,
        "cName": "德宏",
        "Dealers": [{
            "dName": "德宏龙泰通达汽车销售有限公司",
            "dCode": "S212002"
        }]
    }, {
        "cId": 446,
        "cName": "宣威",
        "Dealers": [{
            "dName": "宣威市添福源汽车贸易有限公司",
            "dCode": "S212005"
        }]
    }]
}, {
    "pId": 28,
    "pName": "宁夏",
    "Cities": [{
        "cId": 447,
        "cName": "银川",
        "Dealers": [{
            "dName": "宁夏润众汽车销售服务有限公司",
            "dCode": "S764001"
        }, {
            "dName": "宁夏润之星汽车销售服务有限公司",
            "dCode": "S764003"
        }]
    }, {
        "cId": 452,
        "cName": "贺兰",
        "Dealers": [{
            "dName": "宁夏润之杰汽车销售服务有限责任公司",
            "dCode": "S764002"
        }]
    }, {
        "cId": 453,
        "cName": "石嘴山",
        "Dealers": [{
            "dName": "石嘴山市朗宁汽车销售服务有限责任公司",
            "dCode": "S764004"
        }]
    }, {
        "cId": 458,
        "cName": "吴忠",
        "Dealers": [{
            "dName": "吴忠市润众汽车销售服务有限公司",
            "dCode": "S264001"
        }]
    }]
}, {
    "pId": 29,
    "pName": "甘肃",
    "Cities": [{
        "cId": 448,
        "cName": "嘉峪关",
        "Dealers": [{
            "dName": "甘肃友好汽车服务有限责任公司",
            "dCode": "S762006"
        }]
    }, {
        "cId": 449,
        "cName": "兰州",
        "Dealers": [{
            "dName": "兰州庞大一众汽车销售服务有限公司",
            "dCode": "S762008"
        }, {
            "dName": "兰州新纪元汽车销售服务有限公司",
            "dCode": "S762012"
        }, {
            "dName": "兰州金盛强汽车销售有限公司",
            "dCode": "S762013"
        }, {
            "dName": "兰州金岛汽车销售有限公司",
            "dCode": "S762002"
        }]
    }, {
        "cId": 450,
        "cName": "白银",
        "Dealers": [{
            "dName": "白银庞大一众汽车销售服务有限公司",
            "dCode": "S762009"
        }]
    }, {
        "cId": 455,
        "cName": "酒泉",
        "Dealers": [{
            "dName": "酒泉金岛汽车销售服务有限公司",
            "dCode": "S762015"
        }]
    }, {
        "cId": 456,
        "cName": "平凉",
        "Dealers": [{
            "dName": "平凉润之杰汽车销售服务有限公司",
            "dCode": "S762016"
        }]
    }, {
        "cId": 457,
        "cName": "武威",
        "Dealers": [{
            "dName": "武威赛亚汇众汽车销售服务有限公司",
            "dCode": "S762018"
        }]
    }, {
        "cId": 460,
        "cName": "金昌",
        "Dealers": [{
            "dName": "金昌赛亚汇通汽车销售服务有限公司",
            "dCode": "S262001"
        }]
    }, {
        "cId": 461,
        "cName": "临夏市",
        "Dealers": [{
            "dName": "临夏州源通汽车销售有限公司",
            "dCode": "S262002"
        }]
    }]
}, {
    "pId": 30,
    "pName": "青海",
    "Cities": [{
        "cId": 451,
        "cName": "西宁",
        "Dealers": [{
            "dName": "青海通瑞汽车贸易有限公司",
            "dCode": "S763002"
        }, {
            "dName": "青海海通汽车贸易有限公司",
            "dCode": "S763001"
        }]
    }, {
        "cId": 459,
        "cName": "格尔木",
        "Dealers": [{
            "dName": "格尔木宝瑞通汽车贸易有限公司",
            "dCode": "S263001"
        }]
    }]
}, {
    "pId": 31,
    "pName": "西藏",
    "Cities": [{
        "cId": 454,
        "cName": "拉萨",
        "Dealers": [{
            "dName": "拉萨康达汽贸有限责任公司",
            "dCode": "S954001"
        }]
    }]
}]